STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257cxx_cm33.h
/*
 * @brief LDVS unit (LVDS)
 */
typedef struct
{
  __IO uint32_t CR;               /*!< LVDS configuration register                                     Address offset: 0x0000 */
  __IO uint32_t DMLCR0;           /*!< LVDS data mapping lsb configuration register 0                  Address offset: 0x0004 */
  __IO uint32_t DMMCR0;           /*!< LVDS data mapping msb configuration register 0                  Address offset: 0x0008 */
  __IO uint32_t DMLCR1;           /*!< LVDS data mapping lsb configuration register 1                  Address offset: 0x000C */
  __IO uint32_t DMMCR1;           /*!< LVDS data mapping msb configuration register 1                  Address offset: 0x0010 */
  __IO uint32_t DMLCR2;           /*!< LVDS data mapping lsb configuration register 2                  Address offset: 0x0014 */
  __IO uint32_t DMMCR2;           /*!< LVDS data mapping msb configuration register 2                  Address offset: 0x0018 */
  __IO uint32_t DMLCR3;           /*!< LVDS data mapping lsb configuration register 3                  Address offset: 0x001C */
  __IO uint32_t DMMCR3;           /*!< LVDS data mapping msb configuration register 3                  Address offset: 0x0020 */
  __IO uint32_t DMLCR4;           /*!< LVDS data mapping lsb configuration register 4                  Address offset: 0x0024 */
  __IO uint32_t DMMCR4;           /*!< LVDS data mapping msb configuration register 4                  Address offset: 0x0028 */
  __IO uint32_t CDL1CR;           /*!< LVDS channel distrib link 1configuration register               Address offset: 0x002C */
  __IO uint32_t CDL2CR;           /*!< LVDS channel distrib link 2 configuration register              Address offset: 0x0030 */
       uint32_t RESERVED0[1011];  /*!< Reserved                                                        Address offset: 0x0034-0x0FFC */
  __IO uint32_t PMGCR;            /*!< LVDS PHY-Master global control register                         Address offset: 0x1000 */
  __IO uint32_t PMPEACR;          /*!< LVDS PHY-Master pre-emphasis amplitude control register         Address offset: 0x1004 */
  __IO uint32_t PMPETCR;          /*!< LVDS PHY-Master pre-emphasis time control register              Address offset: 0x1008 */
  __IO uint32_t PMCMCR1;          /*!< LVDS PHY-Master current mode control register 1                 Address offset: 0x100C */
  __IO uint32_t PMCMCR2;          /*!< LVDS PHY-Master current mode control register 2                 Address offset: 0x1010 */
  __IO uint32_t PMRLPCR;          /*!< LVDS PHY-Master Rx loopback control register                    Address offset: 0x1014 */
  __IO uint32_t PMRLPSR;          /*!< LVDS PHY-master Rx loopback status register                     Address offset: 0x1018 */
  __IO uint32_t PMFCR;            /*!< LVDS PHY-Master flipedge control register                       Address offset: 0x101C */
  __IO uint32_t PMSCR;            /*!< LVDS PHY-Master serial control register                         Address offset: 0x1020 */
  __IO uint32_t PMSCR1;           /*!< LVDS PHY-Master spare control register 1                        Address offset: 0x1024 */
  __IO uint32_t PMSCR2;           /*!< LVDS PHY-Master spare control register 2                        Address offset: 0x1028 */
  __IO uint32_t PMBCR1;           /*!< LVDS PHY-Master bias control register 1                         Address offset: 0x102C */
  __IO uint32_t PMBCR2;           /*!< LVDS PHY-Master bias control register 2                         Address offset: 0x1030 */
  __IO uint32_t PMBCR3;           /*!< LVDS PHY-Master bias control register 3                         Address offset: 0x1034 */
  __IO uint32_t PMBCR4;           /*!< LVDS PHY-Master bias control register 4                         Address offset: 0x1038 */
  __IO uint32_t PMBCR5;           /*!< LVDS PHY-Master bias control register 5                         Address offset: 0x103C */
  __IO uint32_t PMICR;            /*!< LVDS PHY-Master impedance control register                      Address offset: 0x1040 */
  __IO uint32_t PMMBCCR;          /*!< LVDS PHY-Master monitor bandgap current control register        Address offset: 0x1044 */
  __IO uint32_t PMMBCSR;          /*!< LVDS PHY-Master monitor bandgap current status register         Address offset: 0x1048 */
  __IO uint32_t PMMBLCR;          /*!< LVDS PHY-Master monitor bandgap loop control register           Address offset: 0x104C */
  __IO uint32_t PMMBLSR;          /*!< LVDS PHY-Master monitor bandgap loop status register            Address offset: 0x1050 */
  __IO uint32_t PMMBOVCR;         /*!< LVDS PHY-Master monitor bandgap output voltage control register Address offset: 0x1054 */
  __IO uint32_t PMMBOVSR;         /*!< LVDS PHY-Master monitor bandgap output voltage status register  Address offset: 0x1058 */
  __IO uint32_t PMMPLOVCR;        /*!< LVDS PHY-Master monitor PLL LDO output voltage control register Address offset: 0x105C */
  __IO uint32_t PMMPLOVSR;        /*!< LVDS PHY-Master monitor PLL LDO output voltage status register  Address offset: 0x1060 */
  __IO uint32_t PMMPLCR;          /*!< LVDS PHY-Master monitor PLL lock control register               Address offset: 0x1064 */
  __IO uint32_t PMMPLSR;          /*!< LVDS PHY-Master monitor PLL lock status register                Address offset: 0x1068 */
  __IO uint32_t PMMPROCR;         /*!< LVDS PHY-Master monitor PLL reference OK control register       Address offset: 0x106C */
  __IO uint32_t PMMPROSR;         /*!< LVDS PHY-Master monitor PLL reference OK status register        Address offset: 0x1070 */
  __IO uint32_t PMMSCCR;          /*!< LVDS PHY-Master monitor serializer clock control register       Address offset: 0x1074 */
  __IO uint32_t PMMSCSR;          /*!< LVDS PHY-Master monitor serializer clock status register        Address offset: 0x1078 */
  __IO uint32_t PMMSCR;           /*!< LVDS PHY-Master monitor serializer control register             Address offset: 0x107C */
  __IO uint32_t PMMSSR;           /*!< LVDS PHY-Master monitor serializer status register              Address offset: 0x1080 */
  __IO uint32_t PMDCR;            /*!< LVDS PHY-Master debug control register                          Address offset: 0x1084 */
  __IO uint32_t PMSSR1;           /*!< LVDS PHY-Master spare status register 1                         Address offset: 0x1088 */
  __IO uint32_t PMSSR2;           /*!< LVDS PHY-Master spare status register 2                         Address offset: 0x108C */
       uint32_t RESERVED1[4];     /*!< Reserved                                                        Address offset: 0x1090-0x109C */
  __IO uint32_t PMCFGCR;          /*!< LVDS PHY-Master configuration control register                  Address offset: 0x10A0 */
       uint32_t RESERVED2[7];     /*!< Reserved                                                        Address offset: 0x10A4-0x10BC */
  __IO uint32_t PMPLLCR1;         /*!< LVDS PHY-Master PLL_MODE 1 control register                     Address offset: 0x10C0 */
  __IO uint32_t PMPLLCR2;         /*!< LVDS PHY-Master PLL_MODE 2 control register                     Address offset: 0x10C4 */
  __IO uint32_t PMPLLSR;          /*!< LVDS PHY-Master PLL status register                             Address offset: 0x10C8 */
  __IO uint32_t PMPLLSDCR1;       /*!< LVDS PHY-Master PLL_SD_1 control register                       Address offset: 0x10CC */
  __IO uint32_t PMPLLSDCR2;       /*!< LVDS PHY-Master PLL_SD_2 control register                       Address offset: 0x10D0 */
  __IO uint32_t PMPLLTWGCR1;      /*!< LVDS PHY-Master PLL_TWG_1 control register                      Address offset: 0x10D4 */
  __IO uint32_t PMPLLTWGCR2;      /*!< LVDS PHY-Master PLL_TWG_2 control register                      Address offset: 0x10D8 */
  __IO uint32_t PMPLLLDOCR;       /*!< LVDS PHY-Master PLL_LDO control register                        Address offset: 0x10DC */
  __IO uint32_t PMPLLCPCR;        /*!< LVDS PHY-Master PLL_CP control register                         Address offset: 0x10E0 */
  __IO uint32_t PMPLLCFGCR;       /*!< LVDS PHY-Master PLL_CFG control register                        Address offset: 0x10E4 */
  __IO uint32_t PMPLLTESTCR;      /*!< LVDS PHY-Master PLL_TEST control register                       Address offset: 0x10E8 */
       uint32_t RESERVED3[5];     /*!< Reserved                                                        Address offset: 0x10EC-0x10FC */
  __IO uint32_t PSGCR;            /*!< LVDS PHY-Slave global control register                          Address offset: 0x1100 */
  __IO uint32_t PSPEACR;          /*!< LVDS PHY-Slave pre-emphasis amplitude control register          Address offset: 0x1104 */
  __IO uint32_t PSPETCR;          /*!< LVDS PHY-Slave pre-emphasis time control register               Address offset: 0x1108 */
  __IO uint32_t PSCMCR1;          /*!< LVDS PHY-Slave current mode control register 1                  Address offset: 0x110C */
  __IO uint32_t PSCMCR2;          /*!< LVDS PHY-Slave current mode control register 2                  Address offset: 0x1110 */
  __IO uint32_t PSRLPCR;          /*!< LVDS PHY-Slave Rx loopback control register                     Address offset: 0x1114 */
  __IO uint32_t PSRLPSR;          /*!< LVDS PHY-slave Rx loopback status register                      Address offset: 0x1118 */
  __IO uint32_t PSFCR;            /*!< LVDS PHY-Slave flipedge control register                        Address offset: 0x111C */
  __IO uint32_t PSSCR;            /*!< LVDS PHY-Slave serial control register                          Address offset: 0x1120 */
  __IO uint32_t PSSCR1;           /*!< LVDS PHY-Slave spare control register 1                         Address offset: 0x1124 */
  __IO uint32_t PSSCR2;           /*!< LVDS PHY-Slave spare control register 2                         Address offset: 0x1128 */
  __IO uint32_t PSBCR1;           /*!< LVDS PHY-Slave bias control register 1                          Address offset: 0x112C */
  __IO uint32_t PSBCR2;           /*!< LVDS PHY-Slave bias control register 2                          Address offset: 0x1130 */
  __IO uint32_t PSBCR3;           /*!< LVDS PHY-Slave bias control register 3                          Address offset: 0x1134 */
  __IO uint32_t PSBCR4;           /*!< LVDS PHY-Slave bias control register 4                          Address offset: 0x1138 */
  __IO uint32_t PSBCR5;           /*!< LVDS PHY-Slave bias control register 5                          Address offset: 0x113C */
  __IO uint32_t PSICR;            /*!< LVDS PHY-Slave impedance control register                       Address offset: 0x1140 */
  __IO uint32_t PSMBCCR;          /*!< LVDS PHY-Slave monitor bandgap current control register         Address offset: 0x1144 */
  __IO uint32_t PSMBCSR;          /*!< LVDS PHY-Slave monitor bandgap current status register          Address offset: 0x1148 */
  __IO uint32_t PSMBLCR;          /*!< LVDS PHY-Slave monitor bandgap loop control register            Address offset: 0x114C */
  __IO uint32_t PSMBLSR;          /*!< LVDS PHY-Slave monitor bandgap loop status register             Address offset: 0x1150 */
  __IO uint32_t PSMBOVCR;         /*!< LVDS PHY-Slave monitor bandgap output voltage control register  Address offset: 0x1154 */
  __IO uint32_t PSMBOVSR;         /*!< LVDS PHY-Slave monitor bandgap output voltage status register   Address offset: 0x1158 */
  __IO uint32_t PSMPLOVCR;        /*!< LVDS PHY-Slave monitor PLL LDO output voltage control register  Address offset: 0x115C */
  __IO uint32_t PSMPLOVSR;        /*!< LVDS PHY-Slave monitor PLL LDO output voltage status register   Address offset: 0x1160 */
  __IO uint32_t PSMPLCR;          /*!< LVDS PHY-Slave monitor PLL lock control register                Address offset: 0x1164 */
  __IO uint32_t PSMPLSR;          /*!< LVDS PHY-Slave monitor PLL lock status register                 Address offset: 0x1168 */
  __IO uint32_t PSMPROCR;         /*!< LVDS PHY-Slave monitor PLL reference OK control register        Address offset: 0x116C */
  __IO uint32_t PSMPROSR;         /*!< LVDS PHY-Slave monitor PLL reference OK status register         Address offset: 0x1170 */
  __IO uint32_t PSMSCCR;          /*!< LVDS PHY-Slave monitor serializer clock control register        Address offset: 0x1174 */
  __IO uint32_t PSMSCSR;          /*!< LVDS PHY-Slave monitor serializer clock status register         Address offset: 0x1178 */
  __IO uint32_t PSMSCR;           /*!< LVDS PHY-Slave monitor serializer control register              Address offset: 0x117C */
  __IO uint32_t PSMSSR;           /*!< LVDS PHY-Slave monitor serializer status register               Address offset: 0x1180 */
  __IO uint32_t PSDCR;            /*!< LVDS PHY-Slave debug control register                           Address offset: 0x1184 */
  __IO uint32_t PSSSR1;           /*!< LVDS PHY-Slave spare status register 1                          Address offset: 0x1188 */
  __IO uint32_t PSSSR2;           /*!< LVDS PHY-Slave spare status register 2                          Address offset: 0x118C */
       uint32_t RESERVED4[4];     /*!< Reserved                                                        Address offset: 0x1190-0x119C */
  __IO uint32_t PSCFGCR;          /*!< LVDS PHY-Slave configuration control register                   Address offset: 0x11A0 */
       uint32_t RESERVED5[3];     /*!< Reserved                                                        Address offset: 0x11A4-0x11AC */
  __IO uint32_t WCLKCR;           /*!< LVDS wrapper clock control register                             Address offset: 0x11B0 */
       uint32_t RESERVED6[3];     /*!< Reserved                                                        Address offset: 0x11B4-0x11BC */
  __IO uint32_t PSPLLCR1;         /*!< LVDS PHY-Slave PLL_MODE 1 control register                      Address offset: 0x11C0 */
  __IO uint32_t PSPLLCR2;         /*!< LVDS PHY-Slave PLL_MODE 2 control register                      Address offset: 0x11C4 */
  __IO uint32_t PSPLLSR;          /*!< LVDS PHY-Slave PLL status register                              Address offset: 0x11C8 */
  __IO uint32_t PSPLLSDCR1;       /*!< LVDS PHY-Slave PLL_SD_1 control register                        Address offset: 0x11CC */
  __IO uint32_t PSPLLSDCR2;       /*!< LVDS PHY-Slave PLL_SD_2 control register                        Address offset: 0x11D0 */
  __IO uint32_t PSPLLTWGCR1;      /*!< LVDS PHY-Slave PLL_TWG_1 control register                       Address offset: 0x11D4 */
  __IO uint32_t PSPLLTWGCR2;      /*!< LVDS PHY-Slave PLL_TWG_2 control register                       Address offset: 0x11D8 */
  __IO uint32_t PSPLLLDOCR;       /*!< LVDS PHY-Slave PLL_LDO control register                         Address offset: 0x11DC */
  __IO uint32_t PSPLLCPCR;        /*!< LVDS PHY-Slave PLL_CP control register                          Address offset: 0x11E0 */
  __IO uint32_t PSPLLCFGCR;       /*!< LVDS PHY-Slave PLL_CFG control register                         Address offset: 0x11E4 */
  __IO uint32_t PSPLLTESTCR;      /*!< LVDS PHY-Slave PLL_TEST control register                        Address offset: 0x11E8 */
       uint32_t RESERVED7[5];     /*!< Reserved                                                        Address offset: 0x11EC-0x11FC */
  __IO uint32_t PMATCR1;          /*!< LVDS PHY-Master analog test control register 1                  Address offset: 0x1200 */
  __IO uint32_t PMATCR2;          /*!< LVDS PHY-Master analog test control register 2                  Address offset: 0x1204 */
  __IO uint32_t PMDTCR1;          /*!< LVDS PHY-Master digital test control register 1                 Address offset: 0x1208 */
  __IO uint32_t PMDTCR2;          /*!< LVDS PHY-Master digital test control register 2                 Address offset: 0x120C */
  __IO uint32_t PMDTSR;           /*!< LVDS PHY-Master digital test status register                    Address offset: 0x1210 */
       uint32_t RESERVED8[3];     /*!< Reserved                                                        Address offset: 0x1214-0x121C */
  __IO uint32_t PSATCR1;          /*!< LVDS PHY-Slave analog test control register 1                   Address offset: 0x1220 */
  __IO uint32_t PSATCR2;          /*!< LVDS PHY-Slave analog test control register 2                   Address offset: 0x1224 */
  __IO uint32_t PSDTCR1;          /*!< LVDS PHY-Slave digital test control register 1                  Address offset: 0x1228 */
  __IO uint32_t PSDTCR2;          /*!< LVDS PHY-Slave digital test control register 2                  Address offset: 0x122C */
  __IO uint32_t PSDTSR;           /*!< LVDS PHY-Slave digital test status register                     Address offset: 0x1230 */
       uint32_t RESERVED9[879];   /*!< Reserved                                                        Address offset: 0x1234-0x1FEC */
  __IO uint32_t HWCFGR;           /*!< LVDS HW configuration register                                  Address offset: 0x1FF0 */
  __IO uint32_t VERR;             /*!< LVDS Version register                                           Address offset: 0x1FF4 */
  __IO uint32_t IPIDR;            /*!< LVDS Identification register                                    Address offset: 0x1FF8 */
  __IO uint32_t SIDR;             /*!< LVDS Size Identification register                               Address offset: 0x1FFC */
} LVDS_TypeDef;
/**
  * @brief MDF/ADF
  */
typedef struct
{
 __IO uint32_t GCR;            /*!< MDF Global Control register,             Address offset: 0x00  */
 __IO uint32_t CKGCR;          /*!< MDF Clock Generator Control Register,    Address offset: 0x04  */
 uint32_t     RESERVED1[6];    /*!< Reserved, 0x08-0x1C                                            */
 __IO uint32_t OR;             /*!< MDF  Option Register,                    Address offset: 0x20  */
 uint32_t     RESERVED2[1011]; /*!< Reserved, 0x24-0xFEC                                           */
 __IO uint32_t HWCFGR;         /*!< MDF Hardware Configuration Register,     Address offset:0xFF0  */
 __IO uint32_t VERR;           /*!< MDF Version Register,                    Address offset:0xFF4  */
 __IO uint32_t IPIDR;          /*!< MDF Identification Register,             Address offset:0xFF8  */
 __IO uint32_t SIDR;           /*!< MDF Size Identification Register,        Address offset:0xFFC  */
}MDF_TypeDef;

/**
  * @brief MDF/ADF filter
  */
typedef struct
{
 __IO uint32_t SITFCR;         /*!< MDF Serial Interface Control Register,          Address offset: 0x80 */
 __IO uint32_t BSMXCR;         /*!< MDF Bitstream Matrix Control Register,          Address offset: 0x84 */
 __IO uint32_t DFLTCR;         /*!< MDF Digital Filter Control Register,            Address offset: 0x88 */
 __IO uint32_t DFLTCICR;       /*!< MDF MCIC Configuration Register,                Address offset: 0x8C */
 __IO uint32_t DFLTRSFR;       /*!< MDF Reshape Filter Configuration Register,      Address offset: 0x90 */
 __IO uint32_t DFLTINTR;       /*!< MDF Integrator Configuration Register,          Address offset: 0x94 */
 __IO uint32_t OLDCR;          /*!< MDF Out-Of Limit Detector Control Register,     Address offset: 0x98 */
 __IO uint32_t OLDTHLR;        /*!< MDF OLD Threshold Low Register,                 Address offset: 0x9C */
 __IO uint32_t OLDTHHR;        /*!< MDF OLD Threshold High Register,                Address offset: 0xA0 */
 __IO uint32_t DLYCR;          /*!< MDF Delay control Register,                     Address offset: 0xA4 */
 __IO uint32_t SCDCR;          /*!< MDF short circuit detector control Register,    Address offset: 0xA8 */
 __IO uint32_t DFLTIER;        /*!< MDF DFLT Interrupt enable Register,             Address offset: 0xAC */
 __IO uint32_t DFLTISR;        /*!< MDF DFLT Interrupt status Register,             Address offset: 0xB0 */
 __IO uint32_t OECCR;          /*!< MDF Offset Error Compensation Control Register, Address offset: 0xB4 */
 __IO uint32_t SADCR;          /*!< MDF SAD Control Register,                       Address offset: 0xB8 */
 __IO uint32_t SADCFGR;        /*!< MDF SAD configuration register,                 Address offset: 0xBC */
 __IO uint32_t SADSDLVR;       /*!< MDF SAD Sound level Register,                   Address offset: 0xC0 */
 __IO uint32_t SADANLVR;       /*!< MDF SAD Ambient Noise level Register,           Address offset: 0xC4 */
 uint32_t     RESERVED1[9];    /*!< Reserved, 0xC8-0xE8                                                  */
 __IO uint32_t SNPSDR;         /*!< MDF Snapshot Data Register,                     Address offset: 0xEC */
 __IO uint32_t DFLTDR;         /*!< MDF Digital Filter Data Register,               Address offset: 0xF0 */
} MDF_Filter_TypeDef;

/**
  * @brief OCTO Serial Peripheral Interface
  */

