STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257cxx_cm33.h
/*******************  Bit definition for DSI_FIR0 register  *******************/
#define DSI_FIR0_FAE0_Pos           (0U)
#define DSI_FIR0_FAE0_Msk           (0x1UL << DSI_FIR0_FAE0_Pos)          /*!< 0x00000001 */
#define DSI_FIR0_FAE0               DSI_FIR0_FAE0_Msk                    /*!< Force acknowledge error 0 */
#define DSI_FIR0_FAE1_Pos           (1U)
#define DSI_FIR0_FAE1_Msk           (0x1UL << DSI_FIR0_FAE1_Pos)          /*!< 0x00000002 */
#define DSI_FIR0_FAE1               DSI_FIR0_FAE1_Msk                    /*!< Force acknowledge error 1 */
#define DSI_FIR0_FAE2_Pos           (2U)
#define DSI_FIR0_FAE2_Msk           (0x1UL << DSI_FIR0_FAE2_Pos)          /*!< 0x00000004 */
#define DSI_FIR0_FAE2               DSI_FIR0_FAE2_Msk                    /*!< Force acknowledge error 2 */
#define DSI_FIR0_FAE3_Pos           (3U)
#define DSI_FIR0_FAE3_Msk           (0x1UL << DSI_FIR0_FAE3_Pos)          /*!< 0x00000008 */
#define DSI_FIR0_FAE3               DSI_FIR0_FAE3_Msk                    /*!< Force acknowledge error 3 */
#define DSI_FIR0_FAE4_Pos           (4U)
#define DSI_FIR0_FAE4_Msk           (0x1UL << DSI_FIR0_FAE4_Pos)          /*!< 0x00000010 */
#define DSI_FIR0_FAE4               DSI_FIR0_FAE4_Msk                    /*!< Force acknowledge error 4 */
#define DSI_FIR0_FAE5_Pos           (5U)
#define DSI_FIR0_FAE5_Msk           (0x1UL << DSI_FIR0_FAE5_Pos)          /*!< 0x00000020 */
#define DSI_FIR0_FAE5               DSI_FIR0_FAE5_Msk                    /*!< Force acknowledge error 5 */
#define DSI_FIR0_FAE6_Pos           (6U)
#define DSI_FIR0_FAE6_Msk           (0x1UL << DSI_FIR0_FAE6_Pos)          /*!< 0x00000040 */
#define DSI_FIR0_FAE6               DSI_FIR0_FAE6_Msk                    /*!< Force acknowledge error 6 */
#define DSI_FIR0_FAE7_Pos           (7U)
#define DSI_FIR0_FAE7_Msk           (0x1UL << DSI_FIR0_FAE7_Pos)          /*!< 0x00000080 */
#define DSI_FIR0_FAE7               DSI_FIR0_FAE7_Msk                    /*!< Force acknowledge error 7 */
#define DSI_FIR0_FAE8_Pos           (8U)
#define DSI_FIR0_FAE8_Msk           (0x1UL << DSI_FIR0_FAE8_Pos)          /*!< 0x00000100 */
#define DSI_FIR0_FAE8               DSI_FIR0_FAE8_Msk                    /*!< Force acknowledge error 8 */
#define DSI_FIR0_FAE9_Pos           (9U)
#define DSI_FIR0_FAE9_Msk           (0x1UL << DSI_FIR0_FAE9_Pos)          /*!< 0x00000200 */
#define DSI_FIR0_FAE9               DSI_FIR0_FAE9_Msk                    /*!< Force acknowledge error 9 */
#define DSI_FIR0_FAE10_Pos          (10U)
#define DSI_FIR0_FAE10_Msk          (0x1UL << DSI_FIR0_FAE10_Pos)         /*!< 0x00000400 */
#define DSI_FIR0_FAE10              DSI_FIR0_FAE10_Msk                   /*!< Force acknowledge error 10 */
#define DSI_FIR0_FAE11_Pos          (11U)
#define DSI_FIR0_FAE11_Msk          (0x1UL << DSI_FIR0_FAE11_Pos)         /*!< 0x00000800 */
#define DSI_FIR0_FAE11              DSI_FIR0_FAE11_Msk                   /*!< Force acknowledge error 11 */
#define DSI_FIR0_FAE12_Pos          (12U)
#define DSI_FIR0_FAE12_Msk          (0x1UL << DSI_FIR0_FAE12_Pos)         /*!< 0x00001000 */
#define DSI_FIR0_FAE12              DSI_FIR0_FAE12_Msk                   /*!< Force acknowledge error 12 */
#define DSI_FIR0_FAE13_Pos          (13U)
#define DSI_FIR0_FAE13_Msk          (0x1UL << DSI_FIR0_FAE13_Pos)         /*!< 0x00002000 */
#define DSI_FIR0_FAE13              DSI_FIR0_FAE13_Msk                   /*!< Force acknowledge error 13 */
#define DSI_FIR0_FAE14_Pos          (14U)
#define DSI_FIR0_FAE14_Msk          (0x1UL << DSI_FIR0_FAE14_Pos)         /*!< 0x00004000 */
#define DSI_FIR0_FAE14              DSI_FIR0_FAE14_Msk                   /*!< Force acknowledge error 14 */
#define DSI_FIR0_FAE15_Pos          (15U)
#define DSI_FIR0_FAE15_Msk          (0x1UL << DSI_FIR0_FAE15_Pos)         /*!< 0x00008000 */
#define DSI_FIR0_FAE15              DSI_FIR0_FAE15_Msk                   /*!< Force acknowledge error 15 */
#define DSI_FIR0_FPE0_Pos           (16U)
#define DSI_FIR0_FPE0_Msk           (0x1UL << DSI_FIR0_FPE0_Pos)          /*!< 0x00010000 */
#define DSI_FIR0_FPE0               DSI_FIR0_FPE0_Msk                    /*!< Force PHY error 0 */
#define DSI_FIR0_FPE1_Pos           (17U)
#define DSI_FIR0_FPE1_Msk           (0x1UL << DSI_FIR0_FPE1_Pos)          /*!< 0x00020000 */
#define DSI_FIR0_FPE1               DSI_FIR0_FPE1_Msk                    /*!< Force PHY error 1 */
#define DSI_FIR0_FPE2_Pos           (18U)
#define DSI_FIR0_FPE2_Msk           (0x1UL << DSI_FIR0_FPE2_Pos)          /*!< 0x00040000 */
#define DSI_FIR0_FPE2               DSI_FIR0_FPE2_Msk                    /*!< Force PHY error 2 */
#define DSI_FIR0_FPE3_Pos           (19U)
#define DSI_FIR0_FPE3_Msk           (0x1UL << DSI_FIR0_FPE3_Pos)          /*!< 0x00080000 */
#define DSI_FIR0_FPE3               DSI_FIR0_FPE3_Msk                    /*!< Force PHY error 3 */
#define DSI_FIR0_FPE4_Pos           (20U)
#define DSI_FIR0_FPE4_Msk           (0x1UL << DSI_FIR0_FPE4_Pos)          /*!< 0x00100000 */
#define DSI_FIR0_FPE4               DSI_FIR0_FPE4_Msk                    /*!< Force PHY error 4 */

/*******************  Bit definition for DSI_FIR1 register  *******************/
#define DSI_FIR1_FTOHSTX_Pos        (0U)
#define DSI_FIR1_FTOHSTX_Msk        (0x1UL << DSI_FIR1_FTOHSTX_Pos)       /*!< 0x00000001 */
#define DSI_FIR1_FTOHSTX            DSI_FIR1_FTOHSTX_Msk                 /*!< Force timeout high-speed transmission */
#define DSI_FIR1_FTOLPRX_Pos        (1U)
#define DSI_FIR1_FTOLPRX_Msk        (0x1UL << DSI_FIR1_FTOLPRX_Pos)       /*!< 0x00000002 */
#define DSI_FIR1_FTOLPRX            DSI_FIR1_FTOLPRX_Msk                 /*!< Force timeout low-power reception */
#define DSI_FIR1_FECCSE_Pos         (2U)
#define DSI_FIR1_FECCSE_Msk         (0x1UL << DSI_FIR1_FECCSE_Pos)        /*!< 0x00000004 */
#define DSI_FIR1_FECCSE             DSI_FIR1_FECCSE_Msk                  /*!< Force ECC single-bit error */
#define DSI_FIR1_FECCME_Pos         (3U)
#define DSI_FIR1_FECCME_Msk         (0x1UL << DSI_FIR1_FECCME_Pos)        /*!< 0x00000008 */
#define DSI_FIR1_FECCME             DSI_FIR1_FECCME_Msk                  /*!< Force ECC multi-bit error */
#define DSI_FIR1_FCRCE_Pos          (4U)
#define DSI_FIR1_FCRCE_Msk          (0x1UL << DSI_FIR1_FCRCE_Pos)         /*!< 0x00000010 */
#define DSI_FIR1_FCRCE              DSI_FIR1_FCRCE_Msk                   /*!< Force CRC error */
#define DSI_FIR1_FPSE_Pos           (5U)
#define DSI_FIR1_FPSE_Msk           (0x1UL << DSI_FIR1_FPSE_Pos)          /*!< 0x00000020 */
#define DSI_FIR1_FPSE               DSI_FIR1_FPSE_Msk                    /*!< Force packet size error */
#define DSI_FIR1_FEOTPE_Pos         (6U)
#define DSI_FIR1_FEOTPE_Msk         (0x1UL << DSI_FIR1_FEOTPE_Pos)        /*!< 0x00000040 */
#define DSI_FIR1_FEOTPE             DSI_FIR1_FEOTPE_Msk                  /*!< Force EoTp error */
#define DSI_FIR1_FLPWRE_Pos         (7U)
#define DSI_FIR1_FLPWRE_Msk         (0x1UL << DSI_FIR1_FLPWRE_Pos)        /*!< 0x00000080 */
#define DSI_FIR1_FLPWRE             DSI_FIR1_FLPWRE_Msk                  /*!< Force LTDC payload write error */
#define DSI_FIR1_FGCWRE_Pos         (8U)
#define DSI_FIR1_FGCWRE_Msk         (0x1UL << DSI_FIR1_FGCWRE_Pos)        /*!< 0x00000100 */
#define DSI_FIR1_FGCWRE             DSI_FIR1_FGCWRE_Msk                  /*!< Force generic command write error */
#define DSI_FIR1_FGPWRE_Pos         (9U)
#define DSI_FIR1_FGPWRE_Msk         (0x1UL << DSI_FIR1_FGPWRE_Pos)        /*!< 0x00000200 */
#define DSI_FIR1_FGPWRE             DSI_FIR1_FGPWRE_Msk                  /*!< Force generic payload write error */
#define DSI_FIR1_FGPTXE_Pos         (10U)
#define DSI_FIR1_FGPTXE_Msk         (0x1UL << DSI_FIR1_FGPTXE_Pos)        /*!< 0x00000400 */
#define DSI_FIR1_FGPTXE             DSI_FIR1_FGPTXE_Msk                  /*!< Force generic payload transmit error */
#define DSI_FIR1_FGPRDE_Pos         (11U)
#define DSI_FIR1_FGPRDE_Msk         (0x1UL << DSI_FIR1_FGPRDE_Pos)        /*!< 0x00000800 */
#define DSI_FIR1_FGPRDE             DSI_FIR1_FGPRDE_Msk                  /*!< Force generic payload read error */
#define DSI_FIR1_FGPRXE_Pos         (12U)
#define DSI_FIR1_FGPRXE_Msk         (0x1UL << DSI_FIR1_FGPRXE_Pos)        /*!< 0x00001000 */
#define DSI_FIR1_FGPRXE             DSI_FIR1_FGPRXE_Msk                  /*!< Force generic payload receive error */

/******************  Bit definition for DSI_DLTRCR register  ******************/
#define DSI_DLTRCR_MRD_TIME_Pos     (0U)
#define DSI_DLTRCR_MRD_TIME_Msk     (0x7FFFUL << DSI_DLTRCR_MRD_TIME_Pos) /*!< 0x00007FFF */
#define DSI_DLTRCR_MRD_TIME         DSI_DLTRCR_MRD_TIME_Msk              /*!< Maximum read time */

/*******************  Bit definition for DSI_VSCR register  *******************/
#define DSI_VSCR_EN_Pos             (0U)
#define DSI_VSCR_EN_Msk             (0x1UL << DSI_VSCR_EN_Pos)            /*!< 0x00000001 */
#define DSI_VSCR_EN                 DSI_VSCR_EN_Msk                      /*!< Enable */
#define DSI_VSCR_UR_Pos             (8U)
#define DSI_VSCR_UR_Msk             (0x1UL << DSI_VSCR_UR_Pos)            /*!< 0x00000100 */
#define DSI_VSCR_UR                 DSI_VSCR_UR_Msk                      /*!< Update register */

/*****************  Bit definition for DSI_LCVCIDR register  ******************/
#define DSI_LCVCIDR_VCID_Pos        (0U)
#define DSI_LCVCIDR_VCID_Msk        (0x3UL << DSI_LCVCIDR_VCID_Pos)       /*!< 0x00000003 */
#define DSI_LCVCIDR_VCID            DSI_LCVCIDR_VCID_Msk                 /*!< Virtual channel ID */

