STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257cxx_cm33.h
/******************  Bit definition for DSI_IPIDR register  *******************/
#define DSI_IPIDR_ID_Pos            (0U)
#define DSI_IPIDR_ID_Msk            (0xFFFFFFFFUL << DSI_IPIDR_ID_Pos)    /*!< 0xFFFFFFFF */
#define DSI_IPIDR_ID                DSI_IPIDR_ID_Msk                     /*!< Identification code */

/*******************  Bit definition for DSI_SIDR register  *******************/
#define DSI_SIDR_SID_Pos            (0U)
#define DSI_SIDR_SID_Msk            (0xFFFFFFFFUL << DSI_SIDR_SID_Pos)    /*!< 0xFFFFFFFF */
#define DSI_SIDR_SID                DSI_SIDR_SID_Msk                     /*!< Size and ID */

/******************************************************************************/
/*                                                                            */
/*                  DTS Registers bits definitions                            */
/*                                                                            */
/******************************************************************************/
/***************  Bit definition for DTS_PVTREG_LOCK register  ****************/
#define DTS_PVTREG_LOCK_LOCK_Pos                    (0U)
#define DTS_PVTREG_LOCK_LOCK_Msk                    (0xFFFFFFFFUL << DTS_PVTREG_LOCK_LOCK_Pos)            /*!< 0xFFFFFFFF */
#define DTS_PVTREG_LOCK_LOCK                        DTS_PVTREG_LOCK_LOCK_Msk                             /*!< PVT software lock register */

/****************  Bit definition for DTS_PVTLOCK_SR register  ****************/
#define DTS_PVTLOCK_SR_SW_LOCK_STATUS_Pos           (0U)
#define DTS_PVTLOCK_SR_SW_LOCK_STATUS_Msk           (0x1UL << DTS_PVTLOCK_SR_SW_LOCK_STATUS_Pos)          /*!< 0x00000001 */
#define DTS_PVTLOCK_SR_SW_LOCK_STATUS               DTS_PVTLOCK_SR_SW_LOCK_STATUS_Msk                    /*!< Software lock input status */
#define DTS_PVTLOCK_SR_HW_LOCK_STATUS_Pos           (1U)
#define DTS_PVTLOCK_SR_HW_LOCK_STATUS_Msk           (0x1UL << DTS_PVTLOCK_SR_HW_LOCK_STATUS_Pos)          /*!< 0x00000002 */
#define DTS_PVTLOCK_SR_HW_LOCK_STATUS               DTS_PVTLOCK_SR_HW_LOCK_STATUS_Msk                    /*!< Hardware lock input status */

/****************  Bit definition for DTS_PVTTMR_CR register  *****************/
#define DTS_PVTTMR_CR_TMR_DELAY_Pos                 (0U)
#define DTS_PVTTMR_CR_TMR_DELAY_Msk                 (0xFFFFUL << DTS_PVTTMR_CR_TMR_DELAY_Pos)             /*!< 0x0000FFFF */
#define DTS_PVTTMR_CR_TMR_DELAY                     DTS_PVTTMR_CR_TMR_DELAY_Msk                          /*!< Timer delay */
#define DTS_PVTTMR_CR_TMR_RUN_Pos                   (16U)
#define DTS_PVTTMR_CR_TMR_RUN_Msk                   (0x1UL << DTS_PVTTMR_CR_TMR_RUN_Pos)                  /*!< 0x00010000 */
#define DTS_PVTTMR_CR_TMR_RUN                       DTS_PVTTMR_CR_TMR_RUN_Msk                            /*!< Timer count enable bit */

/****************  Bit definition for DTS_PVTTMR_SR register  *****************/
#define DTS_PVTTMR_SR_TMR_BUSY_Pos                  (0U)
#define DTS_PVTTMR_SR_TMR_BUSY_Msk                  (0x1UL << DTS_PVTTMR_SR_TMR_BUSY_Pos)                 /*!< 0x00000001 */
#define DTS_PVTTMR_SR_TMR_BUSY                      DTS_PVTTMR_SR_TMR_BUSY_Msk                           /*!< Counter busy flag */
#define DTS_PVTTMR_SR_TMR_DONE_Pos                  (1U)
#define DTS_PVTTMR_SR_TMR_DONE_Msk                  (0x1UL << DTS_PVTTMR_SR_TMR_DONE_Pos)                 /*!< 0x00000002 */
#define DTS_PVTTMR_SR_TMR_DONE                      DTS_PVTTMR_SR_TMR_DONE_Msk                           /*!< Counter delay expiration flag */

/****************  Bit definition for DTS_PVTTMR_ICR register  ****************/
#define DTS_PVTTMR_ICR_TMR_IRQ_CLR_Pos              (0U)
#define DTS_PVTTMR_ICR_TMR_IRQ_CLR_Msk              (0x1UL << DTS_PVTTMR_ICR_TMR_IRQ_CLR_Pos)             /*!< 0x00000001 */
#define DTS_PVTTMR_ICR_TMR_IRQ_CLR                  DTS_PVTTMR_ICR_TMR_IRQ_CLR_Msk                       /*!< Timer IRQ clear bit */

/**************  Bit definition for DTS_PVTTMRIRQTESTR register  **************/
#define DTS_PVTTMRIRQTESTR_TMR_IRQ_TEST_Pos         (0U)
#define DTS_PVTTMRIRQTESTR_TMR_IRQ_TEST_Msk         (0x1UL << DTS_PVTTMRIRQTESTR_TMR_IRQ_TEST_Pos)        /*!< 0x00000001 */
#define DTS_PVTTMRIRQTESTR_TMR_IRQ_TEST             DTS_PVTTMRIRQTESTR_TMR_IRQ_TEST_Msk                  /*!< Timer IRQ test bit */

/*****************  Bit definition for DTS_PVT_IER register  ******************/
#define DTS_PVT_IER_TMR_IRQ_ENABLE_Pos              (0U)
#define DTS_PVT_IER_TMR_IRQ_ENABLE_Msk              (0x1UL << DTS_PVT_IER_TMR_IRQ_ENABLE_Pos)             /*!< 0x00000001 */
#define DTS_PVT_IER_TMR_IRQ_ENABLE                  DTS_PVT_IER_TMR_IRQ_ENABLE_Msk                       /*!< Timer IRQ source enable bit */
#define DTS_PVT_IER_TS_IRQ_ENABLE_Pos               (1U)
#define DTS_PVT_IER_TS_IRQ_ENABLE_Msk               (0x1UL << DTS_PVT_IER_TS_IRQ_ENABLE_Pos)              /*!< 0x00000002 */
#define DTS_PVT_IER_TS_IRQ_ENABLE                   DTS_PVT_IER_TS_IRQ_ENABLE_Msk                        /*!< TS IRQ source enable bit */

/**************  Bit definition for DTS_PVTIRQTRMASKR register  ***************/
#define DTS_PVTIRQTRMASKR_TMR_IRQ_MASK_Pos          (0U)
#define DTS_PVTIRQTRMASKR_TMR_IRQ_MASK_Msk          (0x1UL << DTS_PVTIRQTRMASKR_TMR_IRQ_MASK_Pos)         /*!< 0x00000001 */
#define DTS_PVTIRQTRMASKR_TMR_IRQ_MASK              DTS_PVTIRQTRMASKR_TMR_IRQ_MASK_Msk                   /*!< Timer IRQ source mask bit */

/******************  Bit definition for DTS_TS_MR register  *******************/
#define DTS_TS_MR_TS0_IRQ_MASK_Pos                  (0U)
#define DTS_TS_MR_TS0_IRQ_MASK_Msk                  (0x1UL << DTS_TS_MR_TS0_IRQ_MASK_Pos)                 /*!< 0x00000001 */
#define DTS_TS_MR_TS0_IRQ_MASK                      DTS_TS_MR_TS0_IRQ_MASK_Msk                           /*!< TS0 IRQ source mask bit */
#define DTS_TS_MR_TS1_IRQ_MASK_Pos                  (1U)
#define DTS_TS_MR_TS1_IRQ_MASK_Msk                  (0x1UL << DTS_TS_MR_TS1_IRQ_MASK_Pos)                 /*!< 0x00000002 */
#define DTS_TS_MR_TS1_IRQ_MASK                      DTS_TS_MR_TS1_IRQ_MASK_Msk                           /*!< TS1 IRQ source mask bit */

/*****************  Bit definition for DTS_PVTTR_SR register  *****************/
#define DTS_PVTTR_SR_TMR_IRQ_STATUS_Pos             (0U)
#define DTS_PVTTR_SR_TMR_IRQ_STATUS_Msk             (0x1UL << DTS_PVTTR_SR_TMR_IRQ_STATUS_Pos)            /*!< 0x00000001 */
#define DTS_PVTTR_SR_TMR_IRQ_STATUS                 DTS_PVTTR_SR_TMR_IRQ_STATUS_Msk                      /*!< Timer IRQ status bit after masking */

