STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257cxx_cm33.h
/**************  Bit definition for ETH_MMC_FPE_RX_ISR register  **************/
#define ETH_MMC_FPE_RX_ISR_PAECIS_Pos                                   (0U)
#define ETH_MMC_FPE_RX_ISR_PAECIS_Msk                                   (0x1UL << ETH_MMC_FPE_RX_ISR_PAECIS_Pos)                                  /*!< 0x00000001 */
#define ETH_MMC_FPE_RX_ISR_PAECIS                                       ETH_MMC_FPE_RX_ISR_PAECIS_Msk                                            /*!< MMC Rx Packet Assembly Error Counter Interrupt Status */
#define ETH_MMC_FPE_RX_ISR_PSECIS_Pos                                   (1U)
#define ETH_MMC_FPE_RX_ISR_PSECIS_Msk                                   (0x1UL << ETH_MMC_FPE_RX_ISR_PSECIS_Pos)                                  /*!< 0x00000002 */
#define ETH_MMC_FPE_RX_ISR_PSECIS                                       ETH_MMC_FPE_RX_ISR_PSECIS_Msk                                            /*!< MMC Rx Packet SMD Error Counter Interrupt Status */
#define ETH_MMC_FPE_RX_ISR_PAOCIS_Pos                                   (2U)
#define ETH_MMC_FPE_RX_ISR_PAOCIS_Msk                                   (0x1UL << ETH_MMC_FPE_RX_ISR_PAOCIS_Pos)                                  /*!< 0x00000004 */
#define ETH_MMC_FPE_RX_ISR_PAOCIS                                       ETH_MMC_FPE_RX_ISR_PAOCIS_Msk                                            /*!< MMC Rx Packet Assembly OK Counter Interrupt Status */
#define ETH_MMC_FPE_RX_ISR_FCIS_Pos                                     (3U)
#define ETH_MMC_FPE_RX_ISR_FCIS_Msk                                     (0x1UL << ETH_MMC_FPE_RX_ISR_FCIS_Pos)                                    /*!< 0x00000008 */
#define ETH_MMC_FPE_RX_ISR_FCIS                                         ETH_MMC_FPE_RX_ISR_FCIS_Msk                                              /*!< MMC Rx FPE Fragment Counter Interrupt Status */

/**************  Bit definition for ETH_MMC_FPE_RX_IMR register  **************/
#define ETH_MMC_FPE_RX_IMR_PAECIM_Pos                                   (0U)
#define ETH_MMC_FPE_RX_IMR_PAECIM_Msk                                   (0x1UL << ETH_MMC_FPE_RX_IMR_PAECIM_Pos)                                  /*!< 0x00000001 */
#define ETH_MMC_FPE_RX_IMR_PAECIM                                       ETH_MMC_FPE_RX_IMR_PAECIM_Msk                                            /*!< MMC Rx Packet Assembly Error Counter Interrupt Mask */
#define ETH_MMC_FPE_RX_IMR_PSECIM_Pos                                   (1U)
#define ETH_MMC_FPE_RX_IMR_PSECIM_Msk                                   (0x1UL << ETH_MMC_FPE_RX_IMR_PSECIM_Pos)                                  /*!< 0x00000002 */
#define ETH_MMC_FPE_RX_IMR_PSECIM                                       ETH_MMC_FPE_RX_IMR_PSECIM_Msk                                            /*!< MMC Rx Packet SMD Error Counter Interrupt Mask */
#define ETH_MMC_FPE_RX_IMR_PAOCIM_Pos                                   (2U)
#define ETH_MMC_FPE_RX_IMR_PAOCIM_Msk                                   (0x1UL << ETH_MMC_FPE_RX_IMR_PAOCIM_Pos)                                  /*!< 0x00000004 */
#define ETH_MMC_FPE_RX_IMR_PAOCIM                                       ETH_MMC_FPE_RX_IMR_PAOCIM_Msk                                            /*!< MMC Rx Packet Assembly OK Counter Interrupt Mask */
#define ETH_MMC_FPE_RX_IMR_FCIM_Pos                                     (3U)
#define ETH_MMC_FPE_RX_IMR_FCIM_Msk                                     (0x1UL << ETH_MMC_FPE_RX_IMR_FCIM_Pos)                                    /*!< 0x00000008 */
#define ETH_MMC_FPE_RX_IMR_FCIM                                         ETH_MMC_FPE_RX_IMR_FCIM_Msk                                              /*!< MMC Rx FPE Fragment Counter Interrupt Mask */

/************  Bit definition for ETH_RX_PACKET_ASM_ERR register  *************/
#define ETH_RX_PACKET_ASM_ERR_PAEC_Pos                                  (0U)
#define ETH_RX_PACKET_ASM_ERR_PAEC_Msk                                  (0xFFFFFFFFUL << ETH_RX_PACKET_ASM_ERR_PAEC_Pos)                          /*!< 0xFFFFFFFF */
#define ETH_RX_PACKET_ASM_ERR_PAEC                                      ETH_RX_PACKET_ASM_ERR_PAEC_Msk                                           /*!< Rx Packet Assembly Error Counter */

/************  Bit definition for ETH_RX_PACKET_SMD_ERR register  *************/
#define ETH_RX_PACKET_SMD_ERR_PSEC_Pos                                  (0U)
#define ETH_RX_PACKET_SMD_ERR_PSEC_Msk                                  (0xFFFFFFFFUL << ETH_RX_PACKET_SMD_ERR_PSEC_Pos)                          /*!< 0xFFFFFFFF */
#define ETH_RX_PACKET_SMD_ERR_PSEC                                      ETH_RX_PACKET_SMD_ERR_PSEC_Msk                                           /*!< Rx Packet SMD Error Counter */

/************  Bit definition for ETH_RX_PACKET_ASM_OKR register  *************/
#define ETH_RX_PACKET_ASM_OKR_PAOC_Pos                                  (0U)
#define ETH_RX_PACKET_ASM_OKR_PAOC_Msk                                  (0xFFFFFFFFUL << ETH_RX_PACKET_ASM_OKR_PAOC_Pos)                          /*!< 0xFFFFFFFF */
#define ETH_RX_PACKET_ASM_OKR_PAOC                                      ETH_RX_PACKET_ASM_OKR_PAOC_Msk                                           /*!< Rx Packet Assembly OK Counter */

/**************  Bit definition for ETH_RX_FPE_FRAG_CR register  **************/
#define ETH_RX_FPE_FRAG_CR_FFC_Pos                                      (0U)
#define ETH_RX_FPE_FRAG_CR_FFC_Msk                                      (0xFFFFFFFFUL << ETH_RX_FPE_FRAG_CR_FFC_Pos)                              /*!< 0xFFFFFFFF */
#define ETH_RX_FPE_FRAG_CR_FFC                                          ETH_RX_FPE_FRAG_CR_FFC_Msk                                               /*!< Rx FPE Fragment Counter */

/************  Bit definition for ETH_MACL3L4C0R register  *************/
#define ETH_MACL3L4C0R_L3PEN0_Pos           (0U)
#define ETH_MACL3L4C0R_L3PEN0_Msk           (0x1UL << ETH_MACL3L4C0R_L3PEN0_Pos)                 /*!< 0x00000001 */
#define ETH_MACL3L4C0R_L3PEN0               ETH_MACL3L4C0R_L3PEN0_Msk                           /*!< Layer 3 Protocol Enable */
#define ETH_MACL3L4C0R_L3SAM0_Pos           (2U)
#define ETH_MACL3L4C0R_L3SAM0_Msk           (0x1UL << ETH_MACL3L4C0R_L3SAM0_Pos)                 /*!< 0x00000004 */
#define ETH_MACL3L4C0R_L3SAM0               ETH_MACL3L4C0R_L3SAM0_Msk                           /*!< Layer 3 IP SA Match Enable */
#define ETH_MACL3L4C0R_L3SAIM0_Pos          (3U)
#define ETH_MACL3L4C0R_L3SAIM0_Msk          (0x1UL << ETH_MACL3L4C0R_L3SAIM0_Pos)                /*!< 0x00000008 */
#define ETH_MACL3L4C0R_L3SAIM0              ETH_MACL3L4C0R_L3SAIM0_Msk                          /*!< Layer 3 IP SA Inverse Match Enable */
#define ETH_MACL3L4C0R_L3DAM0_Pos           (4U)
#define ETH_MACL3L4C0R_L3DAM0_Msk           (0x1UL << ETH_MACL3L4C0R_L3DAM0_Pos)                 /*!< 0x00000010 */
#define ETH_MACL3L4C0R_L3DAM0               ETH_MACL3L4C0R_L3DAM0_Msk                           /*!< Layer 3 IP DA Match Enable */
#define ETH_MACL3L4C0R_L3DAIM0_Pos          (5U)
#define ETH_MACL3L4C0R_L3DAIM0_Msk          (0x1UL << ETH_MACL3L4C0R_L3DAIM0_Pos)                /*!< 0x00000020 */
#define ETH_MACL3L4C0R_L3DAIM0              ETH_MACL3L4C0R_L3DAIM0_Msk                          /*!< Layer 3 IP DA Inverse Match Enable */
#define ETH_MACL3L4C0R_L3HSBM0_Pos          (6U)
#define ETH_MACL3L4C0R_L3HSBM0_Msk          (0x1FUL << ETH_MACL3L4C0R_L3HSBM0_Pos)               /*!< 0x000007C0 */
#define ETH_MACL3L4C0R_L3HSBM0              ETH_MACL3L4C0R_L3HSBM0_Msk                          /*!< Layer 3 IP SA Higher Bits Match */
#define ETH_MACL3L4C0R_L3HSBM0_0            (0x1UL << ETH_MACL3L4C0R_L3HSBM0_Pos)                /*!< 0x00000040 */
#define ETH_MACL3L4C0R_L3HSBM0_1            (0x2UL << ETH_MACL3L4C0R_L3HSBM0_Pos)                /*!< 0x00000080 */
#define ETH_MACL3L4C0R_L3HSBM0_2            (0x4UL << ETH_MACL3L4C0R_L3HSBM0_Pos)                /*!< 0x00000100 */
#define ETH_MACL3L4C0R_L3HSBM0_3            (0x8UL << ETH_MACL3L4C0R_L3HSBM0_Pos)                /*!< 0x00000200 */
#define ETH_MACL3L4C0R_L3HSBM0_4            (0x10UL << ETH_MACL3L4C0R_L3HSBM0_Pos)               /*!< 0x00000400 */
#define ETH_MACL3L4C0R_L3HDBM0_Pos          (11U)
#define ETH_MACL3L4C0R_L3HDBM0_Msk          (0x1FUL << ETH_MACL3L4C0R_L3HDBM0_Pos)               /*!< 0x0000F800 */
#define ETH_MACL3L4C0R_L3HDBM0              ETH_MACL3L4C0R_L3HDBM0_Msk                          /*!< Layer 3 IP DA Higher Bits Match */
#define ETH_MACL3L4C0R_L3HDBM0_0            (0x1UL << ETH_MACL3L4C0R_L3HDBM0_Pos)                /*!< 0x00000800 */
#define ETH_MACL3L4C0R_L3HDBM0_1            (0x2UL << ETH_MACL3L4C0R_L3HDBM0_Pos)                /*!< 0x00001000 */
#define ETH_MACL3L4C0R_L3HDBM0_2            (0x4UL << ETH_MACL3L4C0R_L3HDBM0_Pos)                /*!< 0x00002000 */
#define ETH_MACL3L4C0R_L3HDBM0_3            (0x8UL << ETH_MACL3L4C0R_L3HDBM0_Pos)                /*!< 0x00004000 */
#define ETH_MACL3L4C0R_L3HDBM0_4            (0x10UL << ETH_MACL3L4C0R_L3HDBM0_Pos)               /*!< 0x00008000 */
#define ETH_MACL3L4C0R_L4PEN0_Pos           (16U)
#define ETH_MACL3L4C0R_L4PEN0_Msk           (0x1UL << ETH_MACL3L4C0R_L4PEN0_Pos)                 /*!< 0x00010000 */
#define ETH_MACL3L4C0R_L4PEN0               ETH_MACL3L4C0R_L4PEN0_Msk                           /*!< Layer 4 Protocol Enable */
#define ETH_MACL3L4C0R_L4SPM0_Pos           (18U)
#define ETH_MACL3L4C0R_L4SPM0_Msk           (0x1UL << ETH_MACL3L4C0R_L4SPM0_Pos)                 /*!< 0x00040000 */
#define ETH_MACL3L4C0R_L4SPM0               ETH_MACL3L4C0R_L4SPM0_Msk                           /*!< Layer 4 Source Port Match Enable */
#define ETH_MACL3L4C0R_L4SPIM0_Pos          (19U)
#define ETH_MACL3L4C0R_L4SPIM0_Msk          (0x1UL << ETH_MACL3L4C0R_L4SPIM0_Pos)                /*!< 0x00080000 */
#define ETH_MACL3L4C0R_L4SPIM0              ETH_MACL3L4C0R_L4SPIM0_Msk                          /*!< Layer 4 Source Port Inverse Match Enable */
#define ETH_MACL3L4C0R_L4DPM0_Pos           (20U)
#define ETH_MACL3L4C0R_L4DPM0_Msk           (0x1UL << ETH_MACL3L4C0R_L4DPM0_Pos)                 /*!< 0x00100000 */
#define ETH_MACL3L4C0R_L4DPM0               ETH_MACL3L4C0R_L4DPM0_Msk                           /*!< Layer 4 Destination Port Match Enable */
#define ETH_MACL3L4C0R_L4DPIM0_Pos          (21U)
#define ETH_MACL3L4C0R_L4DPIM0_Msk          (0x1UL << ETH_MACL3L4C0R_L4DPIM0_Pos)                /*!< 0x00200000 */
#define ETH_MACL3L4C0R_L4DPIM0              ETH_MACL3L4C0R_L4DPIM0_Msk                          /*!< Layer 4 Destination Port Inverse Match Enable */
#define ETH_MACL3L4C0R_DMCHN0_Pos           (24U)
#define ETH_MACL3L4C0R_DMCHN0_Msk           (0x1UL << ETH_MACL3L4C0R_DMCHN0_Pos)                  /*!< 0x01000000 */
#define ETH_MACL3L4C0R_DMCHN0               ETH_MACL3L4C0R_DMCHN0_Msk                           /*!< DMA Channel Number */
#define ETH_MACL3L4C0R_DMCHEN0_Pos          (28U)
#define ETH_MACL3L4C0R_DMCHEN0_Msk          (0x1UL << ETH_MACL3L4C0R_DMCHEN0_Pos)                 /*!< 0x10000000 */
#define ETH_MACL3L4C0R_DMCHEN0              ETH_MACL3L4C0R_DMCHEN0_Msk                          /*!< DMA Channel Select Enable */

