STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257cxx_cm33.h
/******************  Bit definition for LVDS_PSICR register  ******************/
#define LVDS_PSICR_SLV_IMP_CTRL_DL0_Pos                        (0U)
#define LVDS_PSICR_SLV_IMP_CTRL_DL0_Msk                        (0x7UL << LVDS_PSICR_SLV_IMP_CTRL_DL0_Pos)                        /*!< 0x00000007 */
#define LVDS_PSICR_SLV_IMP_CTRL_DL0                            LVDS_PSICR_SLV_IMP_CTRL_DL0_Msk                                  /*!< Impedance control for data lane0 */
#define LVDS_PSICR_SLV_IMP_CTRL_DL0_0                          (0x1UL << LVDS_PSICR_SLV_IMP_CTRL_DL0_Pos)                        /*!< 0x00000001 */
#define LVDS_PSICR_SLV_IMP_CTRL_DL0_1                          (0x2UL << LVDS_PSICR_SLV_IMP_CTRL_DL0_Pos)                        /*!< 0x00000002 */
#define LVDS_PSICR_SLV_IMP_CTRL_DL0_2                          (0x4UL << LVDS_PSICR_SLV_IMP_CTRL_DL0_Pos)                        /*!< 0x00000004 */
#define LVDS_PSICR_SLV_IMP_CTRL_DL1_Pos                        (4U)
#define LVDS_PSICR_SLV_IMP_CTRL_DL1_Msk                        (0x7UL << LVDS_PSICR_SLV_IMP_CTRL_DL1_Pos)                        /*!< 0x00000070 */
#define LVDS_PSICR_SLV_IMP_CTRL_DL1                            LVDS_PSICR_SLV_IMP_CTRL_DL1_Msk                                  /*!< Impedance control for data lane1 */
#define LVDS_PSICR_SLV_IMP_CTRL_DL1_0                          (0x1UL << LVDS_PSICR_SLV_IMP_CTRL_DL1_Pos)                       /*!< 0x00000010 */
#define LVDS_PSICR_SLV_IMP_CTRL_DL1_1                          (0x2UL << LVDS_PSICR_SLV_IMP_CTRL_DL1_Pos)                       /*!< 0x00000020 */
#define LVDS_PSICR_SLV_IMP_CTRL_DL1_2                          (0x4UL << LVDS_PSICR_SLV_IMP_CTRL_DL1_Pos)                       /*!< 0x00000040 */
#define LVDS_PSICR_SLV_IMP_CTRL_DL2_Pos                        (8U)
#define LVDS_PSICR_SLV_IMP_CTRL_DL2_Msk                        (0x7UL << LVDS_PSICR_SLV_IMP_CTRL_DL2_Pos)                        /*!< 0x00000700 */
#define LVDS_PSICR_SLV_IMP_CTRL_DL2                            LVDS_PSICR_SLV_IMP_CTRL_DL2_Msk                                  /*!< Impedance control for data lane0 */
#define LVDS_PSICR_SLV_IMP_CTRL_DL2_0                          (0x1UL << LVDS_PSICR_SLV_IMP_CTRL_DL2_Pos)                      /*!< 0x00000100 */
#define LVDS_PSICR_SLV_IMP_CTRL_DL2_1                          (0x2UL << LVDS_PSICR_SLV_IMP_CTRL_DL2_Pos)                      /*!< 0x00000200 */
#define LVDS_PSICR_SLV_IMP_CTRL_DL2_2                          (0x4UL << LVDS_PSICR_SLV_IMP_CTRL_DL2_Pos)                      /*!< 0x00000400 */
#define LVDS_PSICR_SLV_IMP_CTRL_DL3_Pos                        (12U)
#define LVDS_PSICR_SLV_IMP_CTRL_DL3_Msk                        (0x7UL << LVDS_PSICR_SLV_IMP_CTRL_DL3_Pos)                        /*!< 0x00007000 */
#define LVDS_PSICR_SLV_IMP_CTRL_DL3                            LVDS_PSICR_SLV_IMP_CTRL_DL3_Msk                                  /*!< Impedance control for data lane3 */
#define LVDS_PSICR_SLV_IMP_CTRL_DL3_0                          (0x1UL << LVDS_PSICR_SLV_IMP_CTRL_DL3_Pos)                     /*!< 0x00001000 */
#define LVDS_PSICR_SLV_IMP_CTRL_DL3_1                          (0x2UL << LVDS_PSICR_SLV_IMP_CTRL_DL3_Pos)                     /*!< 0x00002000 */
#define LVDS_PSICR_SLV_IMP_CTRL_DL3_2                          (0x4UL << LVDS_PSICR_SLV_IMP_CTRL_DL3_Pos)                     /*!< 0x00004000 */
#define LVDS_PSICR_SLV_IMP_CTRL_DL4_Pos                        (16U)
#define LVDS_PSICR_SLV_IMP_CTRL_DL4_Msk                        (0x7UL << LVDS_PSICR_SLV_IMP_CTRL_DL4_Pos)                        /*!< 0x00070000 */
#define LVDS_PSICR_SLV_IMP_CTRL_DL4                            LVDS_PSICR_SLV_IMP_CTRL_DL4_Msk                                  /*!< Impedance control for data lane4 */
#define LVDS_PSICR_SLV_IMP_CTRL_DL4_0                          (0x1UL << LVDS_PSICR_SLV_IMP_CTRL_DL4_Pos)                    /*!< 0x00010000 */
#define LVDS_PSICR_SLV_IMP_CTRL_DL4_1                          (0x2UL << LVDS_PSICR_SLV_IMP_CTRL_DL4_Pos)                    /*!< 0x00020000 */
#define LVDS_PSICR_SLV_IMP_CTRL_DL4_2                          (0x4UL << LVDS_PSICR_SLV_IMP_CTRL_DL4_Pos)                    /*!< 0x00040000 */

/*****************  Bit definition for LVDS_PSMBCCR register  *****************/
#define LVDS_PSMBCCR_SLV_MON_BG_CURR_FORCE_FAULT_Pos           (0U)
#define LVDS_PSMBCCR_SLV_MON_BG_CURR_FORCE_FAULT_Msk           (0x1UL << LVDS_PSMBCCR_SLV_MON_BG_CURR_FORCE_FAULT_Pos)           /*!< 0x00000001 */
#define LVDS_PSMBCCR_SLV_MON_BG_CURR_FORCE_FAULT               LVDS_PSMBCCR_SLV_MON_BG_CURR_FORCE_FAULT_Msk                     /*!< Bandgap current monitor force fault */
#define LVDS_PSMBCCR_SLV_MON_BG_CURR_CLEAR_FAULT_Pos           (4U)
#define LVDS_PSMBCCR_SLV_MON_BG_CURR_CLEAR_FAULT_Msk           (0x1UL << LVDS_PSMBCCR_SLV_MON_BG_CURR_CLEAR_FAULT_Pos)           /*!< 0x00000010 */
#define LVDS_PSMBCCR_SLV_MON_BG_CURR_CLEAR_FAULT               LVDS_PSMBCCR_SLV_MON_BG_CURR_CLEAR_FAULT_Msk                     /*!< Bandgap current monitor clear fault */
#define LVDS_PSMBCCR_SLV_MON_BG_CURR_UNMASK_TUNE_Pos           (16U)
#define LVDS_PSMBCCR_SLV_MON_BG_CURR_UNMASK_TUNE_Msk           (0x1FFUL << LVDS_PSMBCCR_SLV_MON_BG_CURR_UNMASK_TUNE_Pos)         /*!< 0x01FF0000 */
#define LVDS_PSMBCCR_SLV_MON_BG_CURR_UNMASK_TUNE               LVDS_PSMBCCR_SLV_MON_BG_CURR_UNMASK_TUNE_Msk                     /*!< Bandgap current timing control for the monitor unmask after startup */
#define LVDS_PSMBCCR_SLV_MON_BG_CURR_UNMASK_TUNE_0             (0x1UL << LVDS_PSMBCCR_SLV_MON_BG_CURR_UNMASK_TUNE_Pos)       /*!< 0x00010000 */
#define LVDS_PSMBCCR_SLV_MON_BG_CURR_UNMASK_TUNE_1             (0x2UL << LVDS_PSMBCCR_SLV_MON_BG_CURR_UNMASK_TUNE_Pos)       /*!< 0x00020000 */
#define LVDS_PSMBCCR_SLV_MON_BG_CURR_UNMASK_TUNE_2             (0x4UL << LVDS_PSMBCCR_SLV_MON_BG_CURR_UNMASK_TUNE_Pos)       /*!< 0x00040000 */
#define LVDS_PSMBCCR_SLV_MON_BG_CURR_UNMASK_TUNE_3             (0x8UL << LVDS_PSMBCCR_SLV_MON_BG_CURR_UNMASK_TUNE_Pos)       /*!< 0x00080000 */
#define LVDS_PSMBCCR_SLV_MON_BG_CURR_UNMASK_TUNE_4             (0x10UL << LVDS_PSMBCCR_SLV_MON_BG_CURR_UNMASK_TUNE_Pos)      /*!< 0x00100000 */
#define LVDS_PSMBCCR_SLV_MON_BG_CURR_UNMASK_TUNE_5             (0x20UL << LVDS_PSMBCCR_SLV_MON_BG_CURR_UNMASK_TUNE_Pos)      /*!< 0x00200000 */
#define LVDS_PSMBCCR_SLV_MON_BG_CURR_UNMASK_TUNE_6             (0x40UL << LVDS_PSMBCCR_SLV_MON_BG_CURR_UNMASK_TUNE_Pos)      /*!< 0x00400000 */
#define LVDS_PSMBCCR_SLV_MON_BG_CURR_UNMASK_TUNE_7             (0x80UL << LVDS_PSMBCCR_SLV_MON_BG_CURR_UNMASK_TUNE_Pos)      /*!< 0x00800000 */
#define LVDS_PSMBCCR_SLV_MON_BG_CURR_UNMASK_TUNE_8             (0x100UL << LVDS_PSMBCCR_SLV_MON_BG_CURR_UNMASK_TUNE_Pos)     /*!< 0x01000000 */

/*****************  Bit definition for LVDS_PSMBCSR register  *****************/
#define LVDS_PSMBCSR_SLV_MON_BG_CURR_PERMANENT_FAULT_Pos       (0U)
#define LVDS_PSMBCSR_SLV_MON_BG_CURR_PERMANENT_FAULT_Msk       (0x1UL << LVDS_PSMBCSR_SLV_MON_BG_CURR_PERMANENT_FAULT_Pos)       /*!< 0x00000001 */
#define LVDS_PSMBCSR_SLV_MON_BG_CURR_PERMANENT_FAULT           LVDS_PSMBCSR_SLV_MON_BG_CURR_PERMANENT_FAULT_Msk                 /*!< Bandgap current monitor permanent fault */
#define LVDS_PSMBCSR_SLV_MON_BG_CURR_FAULT_Pos                 (4U)
#define LVDS_PSMBCSR_SLV_MON_BG_CURR_FAULT_Msk                 (0x1UL << LVDS_PSMBCSR_SLV_MON_BG_CURR_FAULT_Pos)                 /*!< 0x00000010 */
#define LVDS_PSMBCSR_SLV_MON_BG_CURR_FAULT                     LVDS_PSMBCSR_SLV_MON_BG_CURR_FAULT_Msk                           /*!< Bandgap current monitor fault */

/*****************  Bit definition for LVDS_PSMBLCR register  *****************/
#define LVDS_PSMBLCR_SLV_MON_BG_LOOP_FORCE_FAULT_Pos           (0U)
#define LVDS_PSMBLCR_SLV_MON_BG_LOOP_FORCE_FAULT_Msk           (0x1UL << LVDS_PSMBLCR_SLV_MON_BG_LOOP_FORCE_FAULT_Pos)           /*!< 0x00000001 */
#define LVDS_PSMBLCR_SLV_MON_BG_LOOP_FORCE_FAULT               LVDS_PSMBLCR_SLV_MON_BG_LOOP_FORCE_FAULT_Msk                     /*!< Bandgap loop monitor force fault */
#define LVDS_PSMBLCR_SLV_MON_BG_LOOP_CLEAR_FAULT_Pos           (4U)
#define LVDS_PSMBLCR_SLV_MON_BG_LOOP_CLEAR_FAULT_Msk           (0x1UL << LVDS_PSMBLCR_SLV_MON_BG_LOOP_CLEAR_FAULT_Pos)           /*!< 0x00000010 */
#define LVDS_PSMBLCR_SLV_MON_BG_LOOP_CLEAR_FAULT               LVDS_PSMBLCR_SLV_MON_BG_LOOP_CLEAR_FAULT_Msk                     /*!< Bandgap loop monitor clear fault */
#define LVDS_PSMBLCR_SLV_MON_BG_LOOP_UNMASK_TUNE_Pos           (16U)
#define LVDS_PSMBLCR_SLV_MON_BG_LOOP_UNMASK_TUNE_Msk           (0x1FFUL << LVDS_PSMBLCR_SLV_MON_BG_LOOP_UNMASK_TUNE_Pos)         /*!< 0x01FF0000 */
#define LVDS_PSMBLCR_SLV_MON_BG_LOOP_UNMASK_TUNE               LVDS_PSMBLCR_SLV_MON_BG_LOOP_UNMASK_TUNE_Msk                     /*!< Bandgap loop timing control for the monitor unmask after startup */
#define LVDS_PSMBLCR_SLV_MON_BG_LOOP_UNMASK_TUNE_0             (0x1UL << LVDS_PSMBLCR_SLV_MON_BG_LOOP_UNMASK_TUNE_Pos)       /*!< 0x00010000 */
#define LVDS_PSMBLCR_SLV_MON_BG_LOOP_UNMASK_TUNE_1             (0x2UL << LVDS_PSMBLCR_SLV_MON_BG_LOOP_UNMASK_TUNE_Pos)       /*!< 0x00020000 */
#define LVDS_PSMBLCR_SLV_MON_BG_LOOP_UNMASK_TUNE_2             (0x4UL << LVDS_PSMBLCR_SLV_MON_BG_LOOP_UNMASK_TUNE_Pos)       /*!< 0x00040000 */
#define LVDS_PSMBLCR_SLV_MON_BG_LOOP_UNMASK_TUNE_3             (0x8UL << LVDS_PSMBLCR_SLV_MON_BG_LOOP_UNMASK_TUNE_Pos)       /*!< 0x00080000 */
#define LVDS_PSMBLCR_SLV_MON_BG_LOOP_UNMASK_TUNE_4             (0x10UL << LVDS_PSMBLCR_SLV_MON_BG_LOOP_UNMASK_TUNE_Pos)      /*!< 0x00100000 */
#define LVDS_PSMBLCR_SLV_MON_BG_LOOP_UNMASK_TUNE_5             (0x20UL << LVDS_PSMBLCR_SLV_MON_BG_LOOP_UNMASK_TUNE_Pos)      /*!< 0x00200000 */
#define LVDS_PSMBLCR_SLV_MON_BG_LOOP_UNMASK_TUNE_6             (0x40UL << LVDS_PSMBLCR_SLV_MON_BG_LOOP_UNMASK_TUNE_Pos)      /*!< 0x00400000 */
#define LVDS_PSMBLCR_SLV_MON_BG_LOOP_UNMASK_TUNE_7             (0x80UL << LVDS_PSMBLCR_SLV_MON_BG_LOOP_UNMASK_TUNE_Pos)      /*!< 0x00800000 */
#define LVDS_PSMBLCR_SLV_MON_BG_LOOP_UNMASK_TUNE_8             (0x100UL << LVDS_PSMBLCR_SLV_MON_BG_LOOP_UNMASK_TUNE_Pos)     /*!< 0x01000000 */

/*****************  Bit definition for LVDS_PSMBLSR register  *****************/
#define LVDS_PSMBLSR_SLV_MON_BG_LOOP_PERMANENT_FAULT_Pos       (0U)
#define LVDS_PSMBLSR_SLV_MON_BG_LOOP_PERMANENT_FAULT_Msk       (0x1UL << LVDS_PSMBLSR_SLV_MON_BG_LOOP_PERMANENT_FAULT_Pos)       /*!< 0x00000001 */
#define LVDS_PSMBLSR_SLV_MON_BG_LOOP_PERMANENT_FAULT           LVDS_PSMBLSR_SLV_MON_BG_LOOP_PERMANENT_FAULT_Msk                 /*!< Bandgap loop monitor permanent fault */
#define LVDS_PSMBLSR_SLV_MON_BG_LOOP_FAULT_Pos                 (4U)
#define LVDS_PSMBLSR_SLV_MON_BG_LOOP_FAULT_Msk                 (0x1UL << LVDS_PSMBLSR_SLV_MON_BG_LOOP_FAULT_Pos)                 /*!< 0x00000010 */
#define LVDS_PSMBLSR_SLV_MON_BG_LOOP_FAULT                     LVDS_PSMBLSR_SLV_MON_BG_LOOP_FAULT_Msk                           /*!< Bandgap loop monitor fault */

/****************  Bit definition for LVDS_PSMBOVCR register  *****************/
#define LVDS_PSMBOVCR_SLV_MON_BG_VOLT_FORCE_FAULT_Pos          (0U)
#define LVDS_PSMBOVCR_SLV_MON_BG_VOLT_FORCE_FAULT_Msk          (0x1UL << LVDS_PSMBOVCR_SLV_MON_BG_VOLT_FORCE_FAULT_Pos)          /*!< 0x00000001 */
#define LVDS_PSMBOVCR_SLV_MON_BG_VOLT_FORCE_FAULT              LVDS_PSMBOVCR_SLV_MON_BG_VOLT_FORCE_FAULT_Msk                    /*!< Bandgap output voltage monitor force fault */
#define LVDS_PSMBOVCR_SLV_MON_BG_VOLT_CLEAR_FAULT_Pos          (4U)
#define LVDS_PSMBOVCR_SLV_MON_BG_VOLT_CLEAR_FAULT_Msk          (0x1UL << LVDS_PSMBOVCR_SLV_MON_BG_VOLT_CLEAR_FAULT_Pos)          /*!< 0x00000010 */
#define LVDS_PSMBOVCR_SLV_MON_BG_VOLT_CLEAR_FAULT              LVDS_PSMBOVCR_SLV_MON_BG_VOLT_CLEAR_FAULT_Msk                    /*!< Bandgap output voltage monitor clear fault */
#define LVDS_PSMBOVCR_SLV_MON_BG_VOLT_UNMASK_TUNE_Pos          (16U)
#define LVDS_PSMBOVCR_SLV_MON_BG_VOLT_UNMASK_TUNE_Msk          (0x1FFUL << LVDS_PSMBOVCR_SLV_MON_BG_VOLT_UNMASK_TUNE_Pos)        /*!< 0x01FF0000 */
#define LVDS_PSMBOVCR_SLV_MON_BG_VOLT_UNMASK_TUNE              LVDS_PSMBOVCR_SLV_MON_BG_VOLT_UNMASK_TUNE_Msk                    /*!< Bandgap output voltage timing control for the monitor unmask after startup */
#define LVDS_PSMBOVCR_SLV_MON_BG_VOLT_UNMASK_TUNE_0            (0x1UL << LVDS_PSMBOVCR_SLV_MON_BG_VOLT_UNMASK_TUNE_Pos)      /*!< 0x00010000 */
#define LVDS_PSMBOVCR_SLV_MON_BG_VOLT_UNMASK_TUNE_1            (0x2UL << LVDS_PSMBOVCR_SLV_MON_BG_VOLT_UNMASK_TUNE_Pos)      /*!< 0x00020000 */
#define LVDS_PSMBOVCR_SLV_MON_BG_VOLT_UNMASK_TUNE_2            (0x4UL << LVDS_PSMBOVCR_SLV_MON_BG_VOLT_UNMASK_TUNE_Pos)      /*!< 0x00040000 */
#define LVDS_PSMBOVCR_SLV_MON_BG_VOLT_UNMASK_TUNE_3            (0x8UL << LVDS_PSMBOVCR_SLV_MON_BG_VOLT_UNMASK_TUNE_Pos)      /*!< 0x00080000 */
#define LVDS_PSMBOVCR_SLV_MON_BG_VOLT_UNMASK_TUNE_4            (0x10UL << LVDS_PSMBOVCR_SLV_MON_BG_VOLT_UNMASK_TUNE_Pos)     /*!< 0x00100000 */
#define LVDS_PSMBOVCR_SLV_MON_BG_VOLT_UNMASK_TUNE_5            (0x20UL << LVDS_PSMBOVCR_SLV_MON_BG_VOLT_UNMASK_TUNE_Pos)     /*!< 0x00200000 */
#define LVDS_PSMBOVCR_SLV_MON_BG_VOLT_UNMASK_TUNE_6            (0x40UL << LVDS_PSMBOVCR_SLV_MON_BG_VOLT_UNMASK_TUNE_Pos)     /*!< 0x00400000 */
#define LVDS_PSMBOVCR_SLV_MON_BG_VOLT_UNMASK_TUNE_7            (0x80UL << LVDS_PSMBOVCR_SLV_MON_BG_VOLT_UNMASK_TUNE_Pos)     /*!< 0x00800000 */
#define LVDS_PSMBOVCR_SLV_MON_BG_VOLT_UNMASK_TUNE_8            (0x100UL << LVDS_PSMBOVCR_SLV_MON_BG_VOLT_UNMASK_TUNE_Pos)    /*!< 0x01000000 */

/****************  Bit definition for LVDS_PSMBOVSR register  *****************/
#define LVDS_PSMBOVSR_SLV_MON_BG_VOLT_PERMANENT_FAULT_Pos      (0U)
#define LVDS_PSMBOVSR_SLV_MON_BG_VOLT_PERMANENT_FAULT_Msk      (0x1UL << LVDS_PSMBOVSR_SLV_MON_BG_VOLT_PERMANENT_FAULT_Pos)      /*!< 0x00000001 */
#define LVDS_PSMBOVSR_SLV_MON_BG_VOLT_PERMANENT_FAULT          LVDS_PSMBOVSR_SLV_MON_BG_VOLT_PERMANENT_FAULT_Msk                /*!< Bandgap output voltage monitor permanent fault */
#define LVDS_PSMBOVSR_SLV_MON_BG_VOLT_FAULT_Pos                (4U)
#define LVDS_PSMBOVSR_SLV_MON_BG_VOLT_FAULT_Msk                (0x1UL << LVDS_PSMBOVSR_SLV_MON_BG_VOLT_FAULT_Pos)                /*!< 0x00000010 */
#define LVDS_PSMBOVSR_SLV_MON_BG_VOLT_FAULT                    LVDS_PSMBOVSR_SLV_MON_BG_VOLT_FAULT_Msk                          /*!< Bandgap output voltage monitor fault */

/****************  Bit definition for LVDS_PSMPLOVCR register  ****************/
#define LVDS_PSMPLOVCR_SLV_MON_LDO_OK_FORCE_FAULT_Pos          (0U)
#define LVDS_PSMPLOVCR_SLV_MON_LDO_OK_FORCE_FAULT_Msk          (0x1UL << LVDS_PSMPLOVCR_SLV_MON_LDO_OK_FORCE_FAULT_Pos)          /*!< 0x00000001 */
#define LVDS_PSMPLOVCR_SLV_MON_LDO_OK_FORCE_FAULT              LVDS_PSMPLOVCR_SLV_MON_LDO_OK_FORCE_FAULT_Msk                    /*!< PLL LDO output voltage monitor force fault */
#define LVDS_PSMPLOVCR_SLV_MON_LDO_OK_CLEAR_FAULT_Pos          (4U)
#define LVDS_PSMPLOVCR_SLV_MON_LDO_OK_CLEAR_FAULT_Msk          (0x1UL << LVDS_PSMPLOVCR_SLV_MON_LDO_OK_CLEAR_FAULT_Pos)          /*!< 0x00000010 */
#define LVDS_PSMPLOVCR_SLV_MON_LDO_OK_CLEAR_FAULT              LVDS_PSMPLOVCR_SLV_MON_LDO_OK_CLEAR_FAULT_Msk                    /*!< PLL LDO output voltage monitor clear fault */
#define LVDS_PSMPLOVCR_SLV_MON_LDO_OK_UNMASK_TUNE_Pos          (16U)
#define LVDS_PSMPLOVCR_SLV_MON_LDO_OK_UNMASK_TUNE_Msk          (0x1FFUL << LVDS_PSMPLOVCR_SLV_MON_LDO_OK_UNMASK_TUNE_Pos)        /*!< 0x01FF0000 */
#define LVDS_PSMPLOVCR_SLV_MON_LDO_OK_UNMASK_TUNE              LVDS_PSMPLOVCR_SLV_MON_LDO_OK_UNMASK_TUNE_Msk                    /*!< PLL LDO output voltage timing control for the monitor unmask after startup */
#define LVDS_PSMPLOVCR_SLV_MON_LDO_OK_UNMASK_TUNE_0            (0x1UL << LVDS_PSMPLOVCR_SLV_MON_LDO_OK_UNMASK_TUNE_Pos)      /*!< 0x00010000 */
#define LVDS_PSMPLOVCR_SLV_MON_LDO_OK_UNMASK_TUNE_1            (0x2UL << LVDS_PSMPLOVCR_SLV_MON_LDO_OK_UNMASK_TUNE_Pos)      /*!< 0x00020000 */
#define LVDS_PSMPLOVCR_SLV_MON_LDO_OK_UNMASK_TUNE_2            (0x4UL << LVDS_PSMPLOVCR_SLV_MON_LDO_OK_UNMASK_TUNE_Pos)      /*!< 0x00040000 */
#define LVDS_PSMPLOVCR_SLV_MON_LDO_OK_UNMASK_TUNE_3            (0x8UL << LVDS_PSMPLOVCR_SLV_MON_LDO_OK_UNMASK_TUNE_Pos)      /*!< 0x00080000 */
#define LVDS_PSMPLOVCR_SLV_MON_LDO_OK_UNMASK_TUNE_4            (0x10UL << LVDS_PSMPLOVCR_SLV_MON_LDO_OK_UNMASK_TUNE_Pos)     /*!< 0x00100000 */
#define LVDS_PSMPLOVCR_SLV_MON_LDO_OK_UNMASK_TUNE_5            (0x20UL << LVDS_PSMPLOVCR_SLV_MON_LDO_OK_UNMASK_TUNE_Pos)     /*!< 0x00200000 */
#define LVDS_PSMPLOVCR_SLV_MON_LDO_OK_UNMASK_TUNE_6            (0x40UL << LVDS_PSMPLOVCR_SLV_MON_LDO_OK_UNMASK_TUNE_Pos)     /*!< 0x00400000 */
#define LVDS_PSMPLOVCR_SLV_MON_LDO_OK_UNMASK_TUNE_7            (0x80UL << LVDS_PSMPLOVCR_SLV_MON_LDO_OK_UNMASK_TUNE_Pos)     /*!< 0x00800000 */
#define LVDS_PSMPLOVCR_SLV_MON_LDO_OK_UNMASK_TUNE_8            (0x100UL << LVDS_PSMPLOVCR_SLV_MON_LDO_OK_UNMASK_TUNE_Pos)    /*!< 0x01000000 */

