STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257cxx_cm33.h
/* Montgomery multiplication output data */
#define PKA_MONTGOMERY_MUL_OUT_RESULT             ((0xE78U - PKA_RAM_OFFSET)>>2)   /*!< Output result */

/* Generic Arithmetic input data */
#define PKA_ARITHMETIC_ALL_OPS_NB_BITS            ((0x408U - PKA_RAM_OFFSET)>>2)   /*!< Input operand number of bits */
#define PKA_ARITHMETIC_ALL_OPS_IN_OP1             ((0xA50U - PKA_RAM_OFFSET)>>2)   /*!< Input operand op1 */
#define PKA_ARITHMETIC_ALL_OPS_IN_OP2             ((0xC68U - PKA_RAM_OFFSET)>>2)   /*!< Input operand op2 */
#define PKA_ARITHMETIC_ALL_OPS_IN_OP3             ((0x1088U - PKA_RAM_OFFSET)>>2)  /*!< Input operand op2 */

/* Generic Arithmetic output data */
#define PKA_ARITHMETIC_ALL_OPS_OUT_RESULT         ((0xE78U - PKA_RAM_OFFSET)>>2)   /*!< Output result */

/* PKA functions list */
#define PKA_DEFINE_IN_CMSIS                       (1U)                             /*!< i.e. PKA operation define are in CMSIS device not in PKA_HAL header */

#define PKA_MODE_MODULAR_EXP                      ((uint32_t)0x00000000U)          /*!< Compute Montgomery parameter and modular exponentiation */
#define PKA_MODE_MONTGOMERY_PARAM                 ((uint32_t)0x00000001U)          /*!< Compute Montgomery parameter only */
#define PKA_MODE_MODULAR_EXP_FAST_MODE            ((uint32_t)0x00000002U)          /*!< Compute modular exponentiation only (fast, Montgomery parameter should be loaded) */
#define PKA_MODE_MODULAR_EXP_PROTECT              ((uint32_t)0x00000003U)          /*!< Compute modular exponentiation protected */
#define PKA_MODE_RSA_CRT_EXP                      ((uint32_t)0x00000007U)          /*!< RSA CRT exponentiation */
#define PKA_MODE_MODULAR_INV                      ((uint32_t)0x00000008U)          /*!< Modular inversion */
#define PKA_MODE_ARITHMETIC_ADD                   ((uint32_t)0x00000009U)          /*!< Arithmetic addition */
#define PKA_MODE_ARITHMETIC_SUB                   ((uint32_t)0x0000000AU)          /*!< Arithmetic subtraction */
#define PKA_MODE_ARITHMETIC_MUL                   ((uint32_t)0x0000000BU)          /*!< Arithmetic multiplication */
#define PKA_MODE_COMPARISON                       ((uint32_t)0x0000000CU)          /*!< Comparison */
#define PKA_MODE_MODULAR_RED                      ((uint32_t)0x0000000DU)          /*!< Modular reduction */
#define PKA_MODE_MODULAR_ADD                      ((uint32_t)0x0000000EU)          /*!< Modular addition */
#define PKA_MODE_MODULAR_SUB                      ((uint32_t)0x0000000FU)          /*!< Modular subtraction */
#define PKA_MODE_MONTGOMERY_MUL                   ((uint32_t)0x00000010U)          /*!< Montgomery multiplication */
#define PKA_MODE_ECC_MUL                          ((uint32_t)0x00000020U)          /*!< Compute ECC Fp scalar multiplication */
#define PKA_MODE_ECC_COMPLETE_ADD                 ((uint32_t)0x00000023U)          /*!< ECC complete addition */
#define PKA_MODE_ECDSA_SIGNATURE                  ((uint32_t)0x00000024U)          /*!< ECDSA signature */
#define PKA_MODE_ECDSA_VERIFICATION               ((uint32_t)0x00000026U)          /*!< ECDSA verification */
#define PKA_MODE_DOUBLE_BASE_LADDER               ((uint32_t)0x00000027U)          /*!< ECC double base ladder  */
#define PKA_MODE_POINT_CHECK                      ((uint32_t)0x00000028U)          /*!< Point on elliptic curve check */
#define PKA_MODE_ECC_PROJECTIVE_AFF               ((uint32_t)0x0000002FU)          /*!< ECC projective to affine */

/******************************************************************************/
/*                                                                            */
/*                Parallel Synchronous Slave Interface (PSSI )                */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for PSSI_CR register  *******************/
#define PSSI_CR_OUTEN_Pos               (31U)
#define PSSI_CR_OUTEN_Msk               (0x1UL << PSSI_CR_OUTEN_Pos)           /*!< 0x80000000 */
#define PSSI_CR_OUTEN                   PSSI_CR_OUTEN_Msk                      /*!< Data direction selection */
#define PSSI_CR_DMAEN_Pos               (30U)
#define PSSI_CR_DMAEN_Msk               (0x1UL << PSSI_CR_DMAEN_Pos)           /*!< 0x40000000 */
#define PSSI_CR_DMAEN                   PSSI_CR_DMAEN_Msk                      /*!< DMA enable */
#define PSSI_CR_DERDYCFG_Pos            (18U)
#define PSSI_CR_DERDYCFG_Msk            (0x7UL << PSSI_CR_DERDYCFG_Pos)        /*!< 0x001C0000 */
#define PSSI_CR_DERDYCFG                PSSI_CR_DERDYCFG_Msk                   /*!< Data enable and ready configuration */
#define PSSI_CR_ENABLE_Pos              (14U)
#define PSSI_CR_ENABLE_Msk              (0x1UL << PSSI_CR_ENABLE_Pos)          /*!< 0x00004000 */
#define PSSI_CR_ENABLE                  PSSI_CR_ENABLE_Msk                     /*!< PSSI enable */
#define PSSI_CR_EDM_Pos                 (10U)
#define PSSI_CR_EDM_Msk                 (0x3UL << PSSI_CR_EDM_Pos)             /*!< 0x00000C00 */
#define PSSI_CR_EDM                     PSSI_CR_EDM_Msk                        /*!< Extended data mode */
#define PSSI_CR_RDYPOL_Pos              (8U)
#define PSSI_CR_RDYPOL_Msk              (0x1UL << PSSI_CR_RDYPOL_Pos)          /*!< 0x00000C00 */
#define PSSI_CR_RDYPOL                  PSSI_CR_RDYPOL_Msk                     /*!< Ready polarity */
#define PSSI_CR_DEPOL_Pos               (6U)
#define PSSI_CR_DEPOL_Msk               (0x1UL << PSSI_CR_DEPOL_Pos)           /*!< 0x00000C00 */
#define PSSI_CR_DEPOL                   PSSI_CR_DEPOL_Msk                      /*!<  Data enable polarity */
#define PSSI_CR_CKPOL_Pos               (5U)
#define PSSI_CR_CKPOL_Msk               (0x1UL << PSSI_CR_CKPOL_Pos)           /*!< 0x00000C00 */
#define PSSI_CR_CKPOL                   PSSI_CR_CKPOL_Msk                      /*!< Parallel data clock polarity */
/********************  Bit definition for PSSI_SR register  *******************/
#define PSSI_SR_RTT1B_Pos               (3U)
#define PSSI_SR_RTT1B_Msk               (0x1UL << PSSI_SR_RTT1B_Pos)           /*!< 0x00000008 */
#define PSSI_SR_RTT1B                   PSSI_SR_RTT1B_Msk                      /*!< Ready to transfer one byte */
#define PSSI_SR_RTT4B_Pos               (2U)
#define PSSI_SR_RTT4B_Msk               (0x1UL << PSSI_SR_RTT4B_Pos)           /*!< 0x00000004 */
#define PSSI_SR_RTT4B                   PSSI_SR_RTT4B_Msk                      /*!< Ready to transfer four bytes */
/********************  Bit definition for PSSI_RIS register  *******************/
#define PSSI_RIS_OVR_RIS_Pos            (1U)
#define PSSI_RIS_OVR_RIS_Msk            (0x1UL << PSSI_RIS_OVR_RIS_Pos)        /*!< 0x00000002 */
#define PSSI_RIS_OVR_RIS                PSSI_RIS_OVR_RIS_Msk                   /*!< Data buffer overrun/underrun raw interrupt status */
/********************  Bit definition for PSSI_IER register  *******************/
#define PSSI_IER_OVR_IE_Pos             (1U)
#define PSSI_IER_OVR_IE_Msk             (0x1UL << PSSI_IER_OVR_IE_Pos)         /*!< 0x00000002 */
#define PSSI_IER_OVR_IE                 PSSI_IER_OVR_IE_Msk                    /*!< Data buffer overrun/underrun interrupt enable */
/********************  Bit definition for PSSI_MIS register  *******************/
#define PSSI_MIS_OVR_MIS_Pos            (1U)
#define PSSI_MIS_OVR_MIS_Msk            (0x1UL << PSSI_MIS_OVR_MIS_Pos)        /*!< 0x00000002 */
#define PSSI_MIS_OVR_MIS                PSSI_MIS_OVR_MIS_Msk                   /*!< Data buffer overrun/underrun masked interrupt status */
/********************  Bit definition for PSSI_ICR register  *******************/
#define PSSI_ICR_OVR_ISC_Pos            (1U)
#define PSSI_ICR_OVR_ISC_Msk            (0x1UL << PSSI_ICR_OVR_ISC_Pos)        /*!< 0x00000002 */
#define PSSI_ICR_OVR_ISC                PSSI_ICR_OVR_ISC_Msk                   /*!< Data buffer overrun/underrun interrupt status clear */
/********************  Bit definition for PSSI_DR register  *******************/
#define PSSI_DR_DR_Pos                  (0U)
#define PSSI_DR_DR_Msk                  (0xFFFFFFFFUL << PSSI_DR_DR_Pos)       /*!< 0xFFFFFFF */
#define PSSI_DR_DR                      PSSI_DR_DR_Msk                         /*!< Data register  */

/******************************************************************************/
/*                                                                            */
/*                                    (PWR)                                   */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for PWR_CR1 register  ********************/
#define PWR_CR1_VDDIO3VMEN_Pos                 (0U)
#define PWR_CR1_VDDIO3VMEN_Msk                 (0x1UL << PWR_CR1_VDDIO3VMEN_Pos)
#define PWR_CR1_VDDIO3VMEN                     PWR_CR1_VDDIO3VMEN_Msk
#define PWR_CR1_VDDIO4VMEN_Pos                 (1U)
#define PWR_CR1_VDDIO4VMEN_Msk                 (0x1UL << PWR_CR1_VDDIO4VMEN_Pos)
#define PWR_CR1_VDDIO4VMEN                     PWR_CR1_VDDIO4VMEN_Msk
#define PWR_CR1_USB33VMEN_Pos                  (2U)
#define PWR_CR1_USB33VMEN_Msk                  (0x1UL << PWR_CR1_USB33VMEN_Pos)
#define PWR_CR1_USB33VMEN                      PWR_CR1_USB33VMEN_Msk
#define PWR_CR1_UCPDVMEN_Pos                   (3U)
#define PWR_CR1_UCPDVMEN_Msk                   (0x1UL << PWR_CR1_UCPDVMEN_Pos)
#define PWR_CR1_UCPDVMEN                       PWR_CR1_UCPDVMEN_Msk
#define PWR_CR1_AVMEN_Pos                      (4U)
#define PWR_CR1_AVMEN_Msk                      (0x1UL << PWR_CR1_AVMEN_Pos)
#define PWR_CR1_AVMEN                          PWR_CR1_AVMEN_Msk
#define PWR_CR1_VDDIO3SV_Pos                   (8U)
#define PWR_CR1_VDDIO3SV_Msk                   (0x1UL << PWR_CR1_VDDIO3SV_Pos)
#define PWR_CR1_VDDIO3SV                       PWR_CR1_VDDIO3SV_Msk
#define PWR_CR1_VDDIO4SV_Pos                   (9U)
#define PWR_CR1_VDDIO4SV_Msk                   (0x1UL << PWR_CR1_VDDIO4SV_Pos)
#define PWR_CR1_VDDIO4SV                       PWR_CR1_VDDIO4SV_Msk
#define PWR_CR1_UCPDSV_Pos                     (11U)
#define PWR_CR1_UCPDSV_Msk                     (0x1UL << PWR_CR1_UCPDSV_Pos)
#define PWR_CR1_UCPDSV                         PWR_CR1_UCPDSV_Msk
#define PWR_CR1_ASV_Pos                        (12U)
#define PWR_CR1_ASV_Msk                        (0x1UL << PWR_CR1_ASV_Pos)
#define PWR_CR1_ASV                            PWR_CR1_ASV_Msk
#define PWR_CR1_VDDIO3RDY_Pos                  (16U)
#define PWR_CR1_VDDIO3RDY_Msk                  (0x1UL << PWR_CR1_VDDIO3RDY_Pos)
#define PWR_CR1_VDDIO3RDY                      PWR_CR1_VDDIO3RDY_Msk
#define PWR_CR1_VDDIO4RDY_Pos                  (17U)
#define PWR_CR1_VDDIO4RDY_Msk                  (0x1UL << PWR_CR1_VDDIO4RDY_Pos)
#define PWR_CR1_VDDIO4RDY                      PWR_CR1_VDDIO4RDY_Msk
#define PWR_CR1_USB33RDY_Pos                   (18U)
#define PWR_CR1_USB33RDY_Msk                   (0x1UL << PWR_CR1_USB33RDY_Pos)
#define PWR_CR1_USB33RDY                       PWR_CR1_USB33RDY_Msk
#define PWR_CR1_UCPDRDY_Pos                    (19U)
#define PWR_CR1_UCPDRDY_Msk                    (0x1UL << PWR_CR1_UCPDRDY_Pos)
#define PWR_CR1_UCPDRDY                         PWR_CR1_UCPDRDY_Msk
#define PWR_CR1_ARDY_Pos                       (20U)
#define PWR_CR1_ARDY_Msk                       (0x1UL << PWR_CR1_ARDY_Pos)
#define PWR_CR1_ARDY                           PWR_CR1_ARDY_Msk
#define PWR_CR1_VDDIOVRSEL_Pos                 (24U)
#define PWR_CR1_VDDIOVRSEL_Msk                 (0x1UL << PWR_CR1_VDDIOVRSEL_Pos)
#define PWR_CR1_VDDIOVRSEL                     PWR_CR1_VDDIOVRSEL_Msk
#define PWR_CR1_VDDIO3VRSEL_Pos                (25U)
#define PWR_CR1_VDDIO3VRSEL_Msk                (0x1UL << PWR_CR1_VDDIO3VRSEL_Pos)
#define PWR_CR1_VDDIO3VRSEL                    PWR_CR1_VDDIO3VRSEL_Msk
#define PWR_CR1_VDDIO4VRSEL_Pos                (26U)
#define PWR_CR1_VDDIO4VRSEL_Msk                (0x1UL << PWR_CR1_VDDIO4VRSEL_Pos)
#define PWR_CR1_VDDIO4VRSEL                    PWR_CR1_VDDIO4VRSEL_Msk
#define PWR_CR1_GPVMO_Pos                      (31U)
#define PWR_CR1_GPVMO_Msk                      (0x1UL << PWR_CR1_GPVMO_Pos)
#define PWR_CR1_GPVMO                          PWR_CR1_GPVMO_Msk

/* Bit fields for PWR_CR2 register */
#define PWR_CR2_MONEN_Pos                      (0U)
#define PWR_CR2_MONEN_Msk                      (0x1UL << PWR_CR2_MONEN_Pos)
#define PWR_CR2_MONEN                          PWR_CR2_MONEN_Msk  /*!< VBAT and temperature monitoring enableWhen set, the VBAT supply and temperature monitoring is enabled.- 0: VBAT and temperature monitoring disabled.- 1: VBAT and temperature monitoring enabled. */
#define PWR_CR2_VBATL_Pos                      (8U)
#define PWR_CR2_VBATL_Msk                      (0x1UL << PWR_CR2_VBATL_Pos)
#define PWR_CR2_VBATL                          PWR_CR2_VBATL_Msk  /*!< Monitored VBAT level above low threshold- 0: VBAT level above low threshold level, or Monitor disabled.- 1: VBAT level equal or below low threshold level. */
#define PWR_CR2_VBATH_Pos                      (9U)
#define PWR_CR2_VBATH_Msk                      (0x1UL << PWR_CR2_VBATH_Pos)
#define PWR_CR2_VBATH                          PWR_CR2_VBATH_Msk  /*!< Monitored VBAT level above high threshold- 0: VBAT level below high threshold level, or Monitor disabled.- 1: VBAT level equal or above high threshold level. */
#define PWR_CR2_TEMPL_Pos                      (10U)
#define PWR_CR2_TEMPL_Msk                      (0x1UL << PWR_CR2_TEMPL_Pos)
#define PWR_CR2_TEMPL                          PWR_CR2_TEMPL_Msk  /*!< Monitored temperature level above low threshold- 0: Temperature above low threshold level, or Monitor disabled.- 1: Temperature equal or below low threshold level. */
#define PWR_CR2_TEMPH_Pos                      (11U)
#define PWR_CR2_TEMPH_Msk                      (0x1UL << PWR_CR2_TEMPH_Pos)
#define PWR_CR2_TEMPH                          PWR_CR2_TEMPH_Msk  /*!< Monitored temperature level above high threshold- 0: Temperature below high threshold level, or Monitor disabled.- 1: Temperature equal or above high threshold level. */

/* Bit fields for PWR_CR3 register */
#define PWR_CR3_PVDEN_Pos                      (0U)
#define PWR_CR3_PVDEN_Msk                      (0x1UL << PWR_CR3_PVDEN_Pos)
#define PWR_CR3_PVDEN                          PWR_CR3_PVDEN_Msk  /*!< Programmable Voltage detector enable.This bit is read only when the SYSCFG register bit PVDL is set. (When PVDL is set, there will be no bus errors generated when writing this register).- 0: Programmable Voltage detector disabled.- 1: Programmable Voltage detector enabled. */
#define PWR_CR3_PVDO_Pos                       (8U)
#define PWR_CR3_PVDO_Msk                       (0x1UL << PWR_CR3_PVDO_Pos)
#define PWR_CR3_PVDO                           PWR_CR3_PVDO_Msk  /*!< Programmable Voltage Detect OutputThis bit is set and cleared by hardware. It is valid only if PVD is enabled by the PVDEN bit.- 0: VDD or voltage level on PVD_IN is equal or higher than the PVD threshold selected with the PLS[2:0] bits.- 1: VDD or voltage level on PVD_IN is lower than the PVD threshold selected with the PLS[2:0] bits.The PVD is disabled in Standby mode and after a system reset. For this reason, this bit is equal to 0 after Standby and system reset. */


/* Bit fields for PWR_CR5 register */
#define PWR_CR5_VCOREMONEN_Pos                 (0U)
#define PWR_CR5_VCOREMONEN_Msk                 (0x1UL << PWR_CR5_VCOREMONEN_Pos)
#define PWR_CR5_VCOREMONEN                     PWR_CR5_VCOREMONEN_Msk  /*!< VDDCORE monitoring enable.When set, the VDDCORE supply monitoring is enabled.- 0: VDDCORE monitoring disabled.- 1: VDDCORE monitoring enabled. */
#define PWR_CR5_VCOREL_Pos                     (8U)
#define PWR_CR5_VCOREL_Msk                     (0x1UL << PWR_CR5_VCOREL_Pos)
#define PWR_CR5_VCOREL                         PWR_CR5_VCOREL_Msk  /*!< Monitored VDDCORE level above low threshold.- 0: VDDCORE level above low threshold level, or Monitor disabled.- 1: VDDCORE level equal or below low threshold level. */
#define PWR_CR5_VCOREH_Pos                     (9U)
#define PWR_CR5_VCOREH_Msk                     (0x1UL << PWR_CR5_VCOREH_Pos)
#define PWR_CR5_VCOREH                         PWR_CR5_VCOREH_Msk  /*!< Monitored VDDCORE level above high threshold.- 0: VDDCORE level below high threshold level, or Monitor disabled.- 1: VDDCORE level equal or above high threshold level. */

