STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257cxx_cm33.h
/* Bit fields for RCC_C1SREQSETR register */
#define RCC_C1SREQSETR_STPREQ_P0_Pos                 (0U)
#define RCC_C1SREQSETR_STPREQ_P0_Msk                 (0x1UL << RCC_C1SREQSETR_STPREQ_P0_Pos)                /*!< 0x00000001 */
#define RCC_C1SREQSETR_STPREQ_P0                     RCC_C1SREQSETR_STPREQ_P0_Msk                          /*!< Stop request for CPU1 processor core 0 */
#define RCC_C1SREQSETR_STPREQ_P1_Pos                 (1U)
#define RCC_C1SREQSETR_STPREQ_P1_Msk                 (0x1UL << RCC_C1SREQSETR_STPREQ_P1_Pos)                /*!< 0x00000002 */
#define RCC_C1SREQSETR_STPREQ_P1                     RCC_C1SREQSETR_STPREQ_P1_Msk                          /*!< Stop request for CPU1 processor core 1 */
#define RCC_C1SREQSETR_ESLPREQ_Pos                   (16U)
#define RCC_C1SREQSETR_ESLPREQ_Msk                   (0x1UL << RCC_C1SREQSETR_ESLPREQ_Pos)                  /*!< 0x00010000 */
#define RCC_C1SREQSETR_ESLPREQ                       RCC_C1SREQSETR_ESLPREQ_Msk                            /*!< Enhanced CSleep request for CPU1 subsystem */

/* Bit fields for RCC_C1SREQCLRR register */
#define RCC_C1SREQCLRR_STPREQ_P0_Pos                 (0U)
#define RCC_C1SREQCLRR_STPREQ_P0_Msk                 (0x1UL << RCC_C1SREQCLRR_STPREQ_P0_Pos)                /*!< 0x00000001 */
#define RCC_C1SREQCLRR_STPREQ_P0                     RCC_C1SREQCLRR_STPREQ_P0_Msk                          /*!< Stop request for CPU1 processor core 0 */
#define RCC_C1SREQCLRR_STPREQ_P1_Pos                 (1U)
#define RCC_C1SREQCLRR_STPREQ_P1_Msk                 (0x1UL << RCC_C1SREQCLRR_STPREQ_P1_Pos)                /*!< 0x00000002 */
#define RCC_C1SREQCLRR_STPREQ_P1                     RCC_C1SREQCLRR_STPREQ_P1_Msk                          /*!< Stop request for CPU1 processor core 1 */
#define RCC_C1SREQCLRR_ESLPREQ_Pos                   (16U)
#define RCC_C1SREQCLRR_ESLPREQ_Msk                   (0x1UL << RCC_C1SREQCLRR_ESLPREQ_Pos)                  /*!< 0x00010000 */
#define RCC_C1SREQCLRR_ESLPREQ                       RCC_C1SREQCLRR_ESLPREQ_Msk                            /*!< Enhanced CSleep request for CPU1 subsystem */

/* Bit fields for RCC_CPUBOOTCR register */
#define RCC_CPUBOOTCR_BOOT_CPU2_Pos                  (0U)
#define RCC_CPUBOOTCR_BOOT_CPU2_Msk                  (0x1UL << RCC_CPUBOOTCR_BOOT_CPU2_Pos)                 /*!< 0x00000001 */
#define RCC_CPUBOOTCR_BOOT_CPU2                      RCC_CPUBOOTCR_BOOT_CPU2_Msk                           /*!< CPU2 to boot */
#define RCC_CPUBOOTCR_BOOT_CPU1_Pos                  (1U)
#define RCC_CPUBOOTCR_BOOT_CPU1_Msk                  (0x1UL << RCC_CPUBOOTCR_BOOT_CPU1_Pos)                 /*!< 0x00000002 */
#define RCC_CPUBOOTCR_BOOT_CPU1                      RCC_CPUBOOTCR_BOOT_CPU1_Msk                           /*!< CPU1 boot */

/* Bit fields for RCC_STBYBOOTCR register */
#define RCC_STBYBOOTCR_CPU_BEN_SEL_Pos               (1U)
#define RCC_STBYBOOTCR_CPU_BEN_SEL_Msk               (0x1UL << RCC_STBYBOOTCR_CPU_BEN_SEL_Pos)              /*!< 0x00000002 */
#define RCC_STBYBOOTCR_CPU_BEN_SEL                   RCC_STBYBOOTCR_CPU_BEN_SEL_Msk                        /*!< CPU boot select */
#define RCC_STBYBOOTCR_COLD_CPU2_Pos                 (2U)
#define RCC_STBYBOOTCR_COLD_CPU2_Msk                 (0x1UL << RCC_STBYBOOTCR_COLD_CPU2_Pos)                /*!< 0x00000004 */
#define RCC_STBYBOOTCR_COLD_CPU2                     RCC_STBYBOOTCR_COLD_CPU2_Msk                          /*!< CPU2 cold boot */
#define RCC_STBYBOOTCR_CPU2_HW_BEN_Pos               (4U)
#define RCC_STBYBOOTCR_CPU2_HW_BEN_Msk               (0x1UL << RCC_STBYBOOTCR_CPU2_HW_BEN_Pos)              /*!< 0x00000010 */
#define RCC_STBYBOOTCR_CPU2_HW_BEN                   RCC_STBYBOOTCR_CPU2_HW_BEN_Msk                        /*!< CPU2 hardware boot enable */
#define RCC_STBYBOOTCR_CPU1_HW_BEN_Pos               (5U)
#define RCC_STBYBOOTCR_CPU1_HW_BEN_Msk               (0x1UL << RCC_STBYBOOTCR_CPU1_HW_BEN_Pos)              /*!< 0x00000020 */
#define RCC_STBYBOOTCR_CPU1_HW_BEN                   RCC_STBYBOOTCR_CPU1_HW_BEN_Msk                        /*!< CPU1 hardware boot enable */
#define RCC_STBYBOOTCR_RET_CRCERR_RSTEN_Pos          (8U)
#define RCC_STBYBOOTCR_RET_CRCERR_RSTEN_Msk          (0x1UL << RCC_STBYBOOTCR_RET_CRCERR_RSTEN_Pos)         /*!< 0x00000100 */
#define RCC_STBYBOOTCR_RET_CRCERR_RSTEN              RCC_STBYBOOTCR_RET_CRCERR_RSTEN_Msk                   /*!< RETRAM CRC error system reset enable */

/* Bit fields for RCC_LEGBOOTCR register */
#define RCC_LEGBOOTCR_LEGACY_BEN_Pos                 (0U)
#define RCC_LEGBOOTCR_LEGACY_BEN_Msk                 (0x1UL << RCC_LEGBOOTCR_LEGACY_BEN_Pos)                /*!< 0x00000001 */
#define RCC_LEGBOOTCR_LEGACY_BEN                     RCC_LEGBOOTCR_LEGACY_BEN_Msk                          /*!< Enable of the legacy selection mode to choose the first CPU to boot */

/* Bit fields for RCC_BDCR register */
#define RCC_BDCR_LSEON_Pos                           (0U)
#define RCC_BDCR_LSEON_Msk                           (0x1UL << RCC_BDCR_LSEON_Pos)                          /*!< 0x00000001 */
#define RCC_BDCR_LSEON                               RCC_BDCR_LSEON_Msk                                    /*!< LSE oscillator enable */
#define RCC_BDCR_LSEBYP_Pos                          (1U)
#define RCC_BDCR_LSEBYP_Msk                          (0x1UL << RCC_BDCR_LSEBYP_Pos)                         /*!< 0x00000002 */
#define RCC_BDCR_LSEBYP                              RCC_BDCR_LSEBYP_Msk                                   /*!< LSE oscillator bypass */
#define RCC_BDCR_LSERDY_Pos                          (2U)
#define RCC_BDCR_LSERDY_Msk                          (0x1UL << RCC_BDCR_LSERDY_Pos)                         /*!< 0x00000004 */
#define RCC_BDCR_LSERDY                              RCC_BDCR_LSERDY_Msk                                   /*!< LSE oscillator ready */
#define RCC_BDCR_LSEDIGBYP_Pos                       (3U)
#define RCC_BDCR_LSEDIGBYP_Msk                       (0x1UL << RCC_BDCR_LSEDIGBYP_Pos)                      /*!< 0x00000008 */
#define RCC_BDCR_LSEDIGBYP                           RCC_BDCR_LSEDIGBYP_Msk                                /*!< LSE digital bypass */
#define RCC_BDCR_LSEDRV_Pos                          (4U)
#define RCC_BDCR_LSEDRV_Msk                          (0x3UL << RCC_BDCR_LSEDRV_Pos)                         /*!< 0x00000030 */
#define RCC_BDCR_LSEDRV                              RCC_BDCR_LSEDRV_Msk                                   /*!< LSE oscillator driving capability */
#define RCC_BDCR_LSECSSON_Pos                        (6U)
#define RCC_BDCR_LSECSSON_Msk                        (0x1UL << RCC_BDCR_LSECSSON_Pos)                       /*!< 0x00000040 */
#define RCC_BDCR_LSECSSON                            RCC_BDCR_LSECSSON_Msk                                 /*!< LSE CSS enable */
#define RCC_BDCR_LSEGFON_Pos                         (7U)
#define RCC_BDCR_LSEGFON_Msk                         (0x1UL << RCC_BDCR_LSEGFON_Pos)                        /*!< 0x00000080 */
#define RCC_BDCR_LSEGFON                             RCC_BDCR_LSEGFON_Msk                                  /*!< LSE clock glitch filter enable */
#define RCC_BDCR_LSECSSD_Pos                         (8U)
#define RCC_BDCR_LSECSSD_Msk                         (0x1UL << RCC_BDCR_LSECSSD_Pos)                        /*!< 0x00000100 */
#define RCC_BDCR_LSECSSD                             RCC_BDCR_LSECSSD_Msk                                  /*!< LSE CSS failure detection */
#define RCC_BDCR_LSION_Pos                           (9U)
#define RCC_BDCR_LSION_Msk                           (0x1UL << RCC_BDCR_LSION_Pos)                          /*!< 0x00000200 */
#define RCC_BDCR_LSION                               RCC_BDCR_LSION_Msk                                    /*!< LSI oscillator enabled */
#define RCC_BDCR_LSIRDY_Pos                          (10U)
#define RCC_BDCR_LSIRDY_Msk                          (0x1UL << RCC_BDCR_LSIRDY_Pos)                         /*!< 0x00000400 */
#define RCC_BDCR_LSIRDY                              RCC_BDCR_LSIRDY_Msk                                   /*!< LSI oscillator ready */
#define RCC_BDCR_RTCSRC_Pos                          (16U)
#define RCC_BDCR_RTCSRC_Msk                          (0x3UL << RCC_BDCR_RTCSRC_Pos)                         /*!< 0x00030000 */
#define RCC_BDCR_RTCSRC                              RCC_BDCR_RTCSRC_Msk                                   /*!< RTC clock source selection */
#define RCC_BDCR_RTCCKEN_Pos                         (20U)
#define RCC_BDCR_RTCCKEN_Msk                         (0x1UL << RCC_BDCR_RTCCKEN_Pos)                        /*!< 0x00100000 */
#define RCC_BDCR_RTCCKEN                             RCC_BDCR_RTCCKEN_Msk                                  /*!< RTC clock enable */
#define RCC_BDCR_MSIFREQSEL_Pos                      (24U)
#define RCC_BDCR_MSIFREQSEL_Msk                      (0x1UL << RCC_BDCR_MSIFREQSEL_Pos)                     /*!< 0x01000000 */
#define RCC_BDCR_MSIFREQSEL                          RCC_BDCR_MSIFREQSEL_Msk                               /*!< MSI frequency selection */
#define RCC_BDCR_C3SYSTICKSEL_Pos                    (25U)
#define RCC_BDCR_C3SYSTICKSEL_Msk                    (0x1UL << RCC_BDCR_C3SYSTICKSEL_Pos)                   /*!< 0x02000000 */
#define RCC_BDCR_C3SYSTICKSEL                        RCC_BDCR_C3SYSTICKSEL_Msk                             /*!< CPU3 SysTick clock select */
#define RCC_BDCR_VSWRST_Pos                          (31U)
#define RCC_BDCR_VSWRST_Msk                          (0x1UL << RCC_BDCR_VSWRST_Pos)                         /*!< 0x80000000 */
#define RCC_BDCR_VSWRST                              RCC_BDCR_VSWRST_Msk                                   /*!< V&lt;sub&gt;SW&lt;/sub&gt; domain software reset */

/* Bit fields for RCC_D3DCR register */
#define RCC_D3DCR_MSION_Pos                          (0U)
#define RCC_D3DCR_MSION_Msk                          (0x1UL << RCC_D3DCR_MSION_Pos)                         /*!< 0x00000001 */
#define RCC_D3DCR_MSION                              RCC_D3DCR_MSION_Msk                                   /*!< MSI oscillator enable */
#define RCC_D3DCR_MSIKERON_Pos                       (1U)
#define RCC_D3DCR_MSIKERON_Msk                       (0x1UL << RCC_D3DCR_MSIKERON_Pos)                      /*!< 0x00000002 */
#define RCC_D3DCR_MSIKERON                           RCC_D3DCR_MSIKERON_Msk                                /*!< Set by software to force the MSI on, even in Stop mode, in order to be quickly available as kernel  */
#define RCC_D3DCR_MSIRDY_Pos                         (2U)
#define RCC_D3DCR_MSIRDY_Msk                         (0x1UL << RCC_D3DCR_MSIRDY_Pos)                        /*!< 0x00000004 */
#define RCC_D3DCR_MSIRDY                             RCC_D3DCR_MSIRDY_Msk                                  /*!< MSI clock ready flag */
#define RCC_D3DCR_D3PERCKSEL_Pos                     (16U)
#define RCC_D3DCR_D3PERCKSEL_Msk                     (0x3UL << RCC_D3DCR_D3PERCKSEL_Pos)                    /*!< 0x00030000 */
#define RCC_D3DCR_D3PERCKSEL                         RCC_D3DCR_D3PERCKSEL_Msk
#define RCC_D3DCR_D3PERCKSEL_0                       (0x1UL << RCC_D3DCR_D3PERCKSEL_Pos)   /*!< 0x00010000 */
#define RCC_D3DCR_D3PERCKSEL_1                       (0x2UL << RCC_D3DCR_D3PERCKSEL_Pos)   /*!< 0x00020000 */

/* Bit fields for RCC_D3DSR register */
#define RCC_D3DSR_D3STATE_Pos                        (0U)
#define RCC_D3DSR_D3STATE_Msk                        (0x3UL << RCC_D3DSR_D3STATE_Pos)                       /*!< 0x00000003 */
#define RCC_D3DSR_D3STATE                            RCC_D3DSR_D3STATE_Msk                                 /*!< D3 domain state */

