STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257cxx_cm33.h
/* Bit fields for RCC_C2CIFCLRR register */
#define RCC_C2CIFCLRR_LSIRDYF_Pos                    (0U)
#define RCC_C2CIFCLRR_LSIRDYF_Msk                    (0x1UL << RCC_C2CIFCLRR_LSIRDYF_Pos)                   /*!< 0x00000001 */
#define RCC_C2CIFCLRR_LSIRDYF                        RCC_C2CIFCLRR_LSIRDYF_Msk                             /*!< LSI ready interrupt flag */
#define RCC_C2CIFCLRR_LSERDYF_Pos                    (1U)
#define RCC_C2CIFCLRR_LSERDYF_Msk                    (0x1UL << RCC_C2CIFCLRR_LSERDYF_Pos)                   /*!< 0x00000002 */
#define RCC_C2CIFCLRR_LSERDYF                        RCC_C2CIFCLRR_LSERDYF_Msk                             /*!< LSE ready interrupt flag */
#define RCC_C2CIFCLRR_HSIRDYF_Pos                    (2U)
#define RCC_C2CIFCLRR_HSIRDYF_Msk                    (0x1UL << RCC_C2CIFCLRR_HSIRDYF_Pos)                   /*!< 0x00000004 */
#define RCC_C2CIFCLRR_HSIRDYF                        RCC_C2CIFCLRR_HSIRDYF_Msk                             /*!< HSI ready interrupt flag */
#define RCC_C2CIFCLRR_HSERDYF_Pos                    (3U)
#define RCC_C2CIFCLRR_HSERDYF_Msk                    (0x1UL << RCC_C2CIFCLRR_HSERDYF_Pos)                   /*!< 0x00000008 */
#define RCC_C2CIFCLRR_HSERDYF                        RCC_C2CIFCLRR_HSERDYF_Msk                             /*!< HSE ready interrupt flag */
#define RCC_C2CIFCLRR_MSIRDYF_Pos                    (4U)
#define RCC_C2CIFCLRR_MSIRDYF_Msk                    (0x1UL << RCC_C2CIFCLRR_MSIRDYF_Pos)                   /*!< 0x00000010 */
#define RCC_C2CIFCLRR_MSIRDYF                        RCC_C2CIFCLRR_MSIRDYF_Msk                             /*!< MSI ready interrupt flag */
#define RCC_C2CIFCLRR_PLL1RDYF_Pos                   (5U)
#define RCC_C2CIFCLRR_PLL1RDYF_Msk                   (0x1UL << RCC_C2CIFCLRR_PLL1RDYF_Pos)                  /*!< 0x00000020 */
#define RCC_C2CIFCLRR_PLL1RDYF                       RCC_C2CIFCLRR_PLL1RDYF_Msk                            /*!< PLL1 ready interrupt flag */
#define RCC_C2CIFCLRR_PLL2RDYF_Pos                   (6U)
#define RCC_C2CIFCLRR_PLL2RDYF_Msk                   (0x1UL << RCC_C2CIFCLRR_PLL2RDYF_Pos)                  /*!< 0x00000040 */
#define RCC_C2CIFCLRR_PLL2RDYF                       RCC_C2CIFCLRR_PLL2RDYF_Msk                            /*!< PLL2 ready interrupt flag */
#define RCC_C2CIFCLRR_PLL3RDYF_Pos                   (7U)
#define RCC_C2CIFCLRR_PLL3RDYF_Msk                   (0x1UL << RCC_C2CIFCLRR_PLL3RDYF_Pos)                  /*!< 0x00000080 */
#define RCC_C2CIFCLRR_PLL3RDYF                       RCC_C2CIFCLRR_PLL3RDYF_Msk                            /*!< PLL3 ready interrupt flag */
#define RCC_C2CIFCLRR_PLL4RDYF_Pos                   (8U)
#define RCC_C2CIFCLRR_PLL4RDYF_Msk                   (0x1UL << RCC_C2CIFCLRR_PLL4RDYF_Pos)                  /*!< 0x00000100 */
#define RCC_C2CIFCLRR_PLL4RDYF                       RCC_C2CIFCLRR_PLL4RDYF_Msk                            /*!< PLL4 ready interrupt flag */
#define RCC_C2CIFCLRR_PLL5RDYF_Pos                   (9U)
#define RCC_C2CIFCLRR_PLL5RDYF_Msk                   (0x1UL << RCC_C2CIFCLRR_PLL5RDYF_Pos)                  /*!< 0x00000200 */
#define RCC_C2CIFCLRR_PLL5RDYF                       RCC_C2CIFCLRR_PLL5RDYF_Msk                            /*!< PLL5 ready interrupt flag */
#define RCC_C2CIFCLRR_PLL6RDYF_Pos                   (10U)
#define RCC_C2CIFCLRR_PLL6RDYF_Msk                   (0x1UL << RCC_C2CIFCLRR_PLL6RDYF_Pos)                  /*!< 0x00000400 */
#define RCC_C2CIFCLRR_PLL6RDYF                       RCC_C2CIFCLRR_PLL6RDYF_Msk                            /*!< PLL6 ready interrupt flag */
#define RCC_C2CIFCLRR_PLL7RDYF_Pos                   (11U)
#define RCC_C2CIFCLRR_PLL7RDYF_Msk                   (0x1UL << RCC_C2CIFCLRR_PLL7RDYF_Pos)                  /*!< 0x00000800 */
#define RCC_C2CIFCLRR_PLL7RDYF                       RCC_C2CIFCLRR_PLL7RDYF_Msk                            /*!< PLL7 ready interrupt flag */
#define RCC_C2CIFCLRR_PLL8RDYF_Pos                   (12U)
#define RCC_C2CIFCLRR_PLL8RDYF_Msk                   (0x1UL << RCC_C2CIFCLRR_PLL8RDYF_Pos)                  /*!< 0x00001000 */
#define RCC_C2CIFCLRR_PLL8RDYF                       RCC_C2CIFCLRR_PLL8RDYF_Msk                            /*!< PLL8 ready interrupt flag */
#define RCC_C2CIFCLRR_LSECSSF_Pos                    (16U)
#define RCC_C2CIFCLRR_LSECSSF_Msk                    (0x1UL << RCC_C2CIFCLRR_LSECSSF_Pos)                   /*!< 0x00010000 */
#define RCC_C2CIFCLRR_LSECSSF                        RCC_C2CIFCLRR_LSECSSF_Msk                             /*!< LSE clock security system interrupt flag */
#define RCC_C2CIFCLRR_WKUPF_Pos                      (20U)
#define RCC_C2CIFCLRR_WKUPF_Msk                      (0x1UL << RCC_C2CIFCLRR_WKUPF_Pos)                     /*!< 0x00100000 */
#define RCC_C2CIFCLRR_WKUPF                          RCC_C2CIFCLRR_WKUPF_Msk                               /*!< CPU2 wake-up from CStop interrupt flag */

/* Bit fields for RCC_IWDGC1FZSETR register */
#define RCC_IWDGC1FZSETR_FZ_IWDG1_Pos                (0U)
#define RCC_IWDGC1FZSETR_FZ_IWDG1_Msk                (0x1UL << RCC_IWDGC1FZSETR_FZ_IWDG1_Pos)               /*!< 0x00000001 */
#define RCC_IWDGC1FZSETR_FZ_IWDG1                    RCC_IWDGC1FZSETR_FZ_IWDG1_Msk                         /*!< Freeze of IWDG1 clock */
#define RCC_IWDGC1FZSETR_FZ_IWDG2_Pos                (1U)
#define RCC_IWDGC1FZSETR_FZ_IWDG2_Msk                (0x1UL << RCC_IWDGC1FZSETR_FZ_IWDG2_Pos)               /*!< 0x00000002 */
#define RCC_IWDGC1FZSETR_FZ_IWDG2                    RCC_IWDGC1FZSETR_FZ_IWDG2_Msk                         /*!< Freeze of IWDG2 clock */

/* Bit fields for RCC_IWDGC1FZCLRR register */
#define RCC_IWDGC1FZCLRR_FZ_IWDG1_Pos                (0U)
#define RCC_IWDGC1FZCLRR_FZ_IWDG1_Msk                (0x1UL << RCC_IWDGC1FZCLRR_FZ_IWDG1_Pos)               /*!< 0x00000001 */
#define RCC_IWDGC1FZCLRR_FZ_IWDG1                    RCC_IWDGC1FZCLRR_FZ_IWDG1_Msk                         /*!< Unfreeze IWDG1 clock */
#define RCC_IWDGC1FZCLRR_FZ_IWDG2_Pos                (1U)
#define RCC_IWDGC1FZCLRR_FZ_IWDG2_Msk                (0x1UL << RCC_IWDGC1FZCLRR_FZ_IWDG2_Pos)               /*!< 0x00000002 */
#define RCC_IWDGC1FZCLRR_FZ_IWDG2                    RCC_IWDGC1FZCLRR_FZ_IWDG2_Msk                         /*!< Unfreeze IWDG2 clock */

