STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257cxx_cm33.h
#define RIMC_SR_WUCEN_Pos             (1U)
#define RIMC_SR_WUCEN_Msk             (0x1UL << RIMC_SR_WUCEN_Pos)               /*!< 0x00000002 */
#define RIMC_SR_WUCEN                 RIMC_SR_WUCEN_Msk

/*******************  Bits definition for RIMC_ATTRx register *****************/
#define RIMC_ATTR_CIDSEL_Pos          (2U)
#define RIMC_ATTR_CIDSEL_Msk          (0x1UL << RIMC_ATTR_CIDSEL_Pos)            /*!< 0x00000004 */
#define RIMC_ATTR_CIDSEL              RIMC_ATTR_CIDSEL_Msk

#define RIMC_ATTR_MCID_Pos            (4U)
#define RIMC_ATTR_MCID_Msk            (0x7UL << RIMC_ATTR_MCID_Pos)              /*!< 0x00000070 */
#define RIMC_ATTR_MCID                RIMC_ATTR_MCID_Msk
#define RIMC_ATTR_MCID0               (0x0UL << RIMC_ATTR_MCID_Pos)              /*!< 0x00000000 */
#define RIMC_ATTR_MCID1               (0x1UL << RIMC_ATTR_MCID_Pos)              /*!< 0x00000010 */
#define RIMC_ATTR_MCID2               (0x2UL << RIMC_ATTR_MCID_Pos)              /*!< 0x00000020 */
#define RIMC_ATTR_MCID3               (0x3UL << RIMC_ATTR_MCID_Pos)              /*!< 0x00000030 */
#define RIMC_ATTR_MCID4               (0x4UL << RIMC_ATTR_MCID_Pos)              /*!< 0x00000040 */
#define RIMC_ATTR_MCID5               (0x5UL << RIMC_ATTR_MCID_Pos)              /*!< 0x00000050 */
#define RIMC_ATTR_MCID6               (0x6UL << RIMC_ATTR_MCID_Pos)              /*!< 0x00000060 */
#define RIMC_ATTR_MCID7               (0x7UL << RIMC_ATTR_MCID_Pos)              /*!< 0x00000070 */

#define RIMC_ATTR_MSEC_Pos            (8U)
#define RIMC_ATTR_MSEC_Msk            (0x1UL << RIMC_ATTR_MSEC_Pos)              /*!< 0x00000100 */
#define RIMC_ATTR_MSEC                RIMC_ATTR_MSEC_Msk

#define RIMC_ATTR_MPRIV_Pos           (9U)
#define RIMC_ATTR_MPRIV_Msk           (0x1UL << RIMC_ATTR_MPRIV_Pos)             /*!< 0x00000200 */
#define RIMC_ATTR_MPRIV               RIMC_ATTR_MPRIV_Msk

/*******************  Bits definition for RIFSC_VERR register *****************/
#define RIFSC_VERR_MINREV_Pos         (0U)
#define RIFSC_VERR_MINREV_Msk         (0xFUL << RIFSC_VERR_MINREV_Pos)           /*!< 0x0000000F */
#define RIFSC_VERR_MINREV             RIFSC_VERR_MINREV_Msk

#define RIFSC_VERR_MAJREV_Pos         (4U)
#define RIFSC_VERR_MAJREV_Msk         (0xFUL << RIFSC_VERR_MAJREV_Pos)           /*!< 0x000000F0 */
#define RIFSC_VERR_MAJREV             RIFSC_VERR_MAJREV_Msk

/*******************  Bits definition for RIFSC_IPIDR register ****************/
#define RIFSC_IPIDR_ID_Pos            (0U)
#define RIFSC_IPIDR_ID_Msk            (0xFFFFFFFFUL << RIFSC_IPIDR_ID_Pos)       /*!< 0xFFFFFFFF */
#define RIFSC_IPIDR_ID                RIFSC_IPIDR_ID_Msk

/*******************  Bits definition for RIFSC_SIDR register *****************/
#define RIFSC_SIDR_SID_Pos            (0U)
#define RIFSC_SIDR_SID_Msk            (0xFFFFFFFFUL << RIFSC_SIDR_SID_Pos)       /*!< 0xFFFFFFFF */
#define RIFSC_SIDR_SID                RIFSC_SIDR_SID_Msk

/*******************  Bits definition for RISAB_CR register *******************/
#define RISAB_CR_GLOCK_Pos            (0U)
#define RISAB_CR_GLOCK_Msk            (0x1UL << RISAB_CR_GLOCK_Pos)              /*!< 0x00000001 */
#define RISAB_CR_GLOCK                RISAB_CR_GLOCK_Msk

#define RISAB_CR_SRWIAD_Pos           (31U)
#define RISAB_CR_SRWIAD_Msk           (0x1UL << RISAB_CR_SRWIAD_Pos)             /*!< 0x80000000 */
#define RISAB_CR_SRWIAD               RISAB_CR_SRWIAD_Msk

/*******************  Bits definition for RISAB_IASR register *****************/
#define RISAB_IASR_CAEF_Pos           (0U)
#define RISAB_IASR_CAEF_Msk           (0x1UL << RISAB_IASR_CAEF_Pos)             /*!< 0x00000001 */
#define RISAB_IASR_CAEF               RISAB_IASR_CAEF_Msk

#define RISAB_IASR_IAEF_Pos           (1U)
#define RISAB_IASR_IAEF_Msk           (0x1UL << RISAB_IASR_IAEF_Pos)             /*!< 0x00000002 */
#define RISAB_IASR_IAEF               RISAB_IASR_IAEF_Msk

/*******************  Bits definition for RISAB_IACR register *****************/
#define RISAB_IACR_CAEF_Pos           (0U)
#define RISAB_IACR_CAEF_Msk           (0x1UL << RISAB_IACR_CAEF_Pos)             /*!< 0x00000001 */
#define RISAB_IACR_CAEF               RISAB_IACR_CAEF_Msk

#define RISAB_IACR_IAEF_Pos           (1U)
#define RISAB_IACR_IAEF_Msk           (0x1UL << RISAB_IACR_IAEF_Pos)             /*!< 0x00000002 */
#define RISAB_IACR_IAEF               RISAB_IACR_IAEF_Msk

/*******************  Bits definition for RISAB_RIFLOCKR register *************/
#define RISAB_RIFLOCKR_RLOCK_Pos      (0U)
#define RISAB_RIFLOCKR_RLOCK_Msk      (0xFFFFFFFFUL << RISAB_RIFLOCKR_RLOCK_Pos) /*!< 0xFFFFFFFF */
#define RISAB_RIFLOCKR_RLOCK          RISAB_RIFLOCKR_RLOCK_Msk
#define RISAB_RIFLOCKR_RLOCK0_Pos     (0U)
#define RISAB_RIFLOCKR_RLOCK0_Msk     (0x1UL << RISAB_RIFLOCKR_RLOCK0_Pos)       /*!< 0x00000001 */
#define RISAB_RIFLOCKR_RLOCK0         RISAB_RIFLOCKR_RLOCK0_Msk
#define RISAB_RIFLOCKR_RLOCK1_Pos     (1U)
#define RISAB_RIFLOCKR_RLOCK1_Msk     (0x1UL << RISAB_RIFLOCKR_RLOCK1_Pos)       /*!< 0x00000002 */
#define RISAB_RIFLOCKR_RLOCK1         RISAB_RIFLOCKR_RLOCK1_Msk
#define RISAB_RIFLOCKR_RLOCK2_Pos     (2U)
#define RISAB_RIFLOCKR_RLOCK2_Msk     (0x1UL << RISAB_RIFLOCKR_RLOCK2_Pos)       /*!< 0x00000004 */
#define RISAB_RIFLOCKR_RLOCK2         RISAB_RIFLOCKR_RLOCK2_Msk
#define RISAB_RIFLOCKR_RLOCK3_Pos     (3U)
#define RISAB_RIFLOCKR_RLOCK3_Msk     (0x1UL << RISAB_RIFLOCKR_RLOCK3_Pos)       /*!< 0x00000008 */
#define RISAB_RIFLOCKR_RLOCK3         RISAB_RIFLOCKR_RLOCK3_Msk
#define RISAB_RIFLOCKR_RLOCK4_Pos     (4U)
#define RISAB_RIFLOCKR_RLOCK4_Msk     (0x1UL << RISAB_RIFLOCKR_RLOCK4_Pos)       /*!< 0x00000010 */
#define RISAB_RIFLOCKR_RLOCK4         RISAB_RIFLOCKR_RLOCK4_Msk
#define RISAB_RIFLOCKR_RLOCK5_Pos     (5U)
#define RISAB_RIFLOCKR_RLOCK5_Msk     (0x1UL << RISAB_RIFLOCKR_RLOCK5_Pos)       /*!< 0x00000020 */
#define RISAB_RIFLOCKR_RLOCK5         RISAB_RIFLOCKR_RLOCK5_Msk
#define RISAB_RIFLOCKR_RLOCK6_Pos     (6U)
#define RISAB_RIFLOCKR_RLOCK6_Msk     (0x1UL << RISAB_RIFLOCKR_RLOCK6_Pos)       /*!< 0x00000040 */
#define RISAB_RIFLOCKR_RLOCK6         RISAB_RIFLOCKR_RLOCK6_Msk
#define RISAB_RIFLOCKR_RLOCK7_Pos     (7U)
#define RISAB_RIFLOCKR_RLOCK7_Msk     (0x1UL << RISAB_RIFLOCKR_RLOCK7_Pos)       /*!< 0x00000080 */
#define RISAB_RIFLOCKR_RLOCK7         RISAB_RIFLOCKR_RLOCK7_Msk
#define RISAB_RIFLOCKR_RLOCK8_Pos     (8U)
#define RISAB_RIFLOCKR_RLOCK8_Msk     (0x1UL << RISAB_RIFLOCKR_RLOCK8_Pos)       /*!< 0x00000100 */
#define RISAB_RIFLOCKR_RLOCK8         RISAB_RIFLOCKR_RLOCK8_Msk
#define RISAB_RIFLOCKR_RLOCK9_Pos     (9U)
#define RISAB_RIFLOCKR_RLOCK9_Msk     (0x1UL << RISAB_RIFLOCKR_RLOCK9_Pos)       /*!< 0x00000200 */
#define RISAB_RIFLOCKR_RLOCK9         RISAB_RIFLOCKR_RLOCK9_Msk
#define RISAB_RIFLOCKR_RLOCK10_Pos    (10U)
#define RISAB_RIFLOCKR_RLOCK10_Msk    (0x1UL << RISAB_RIFLOCKR_RLOCK10_Pos)      /*!< 0x00000400 */
#define RISAB_RIFLOCKR_RLOCK10        RISAB_RIFLOCKR_RLOCK10_Msk
#define RISAB_RIFLOCKR_RLOCK11_Pos    (11U)
#define RISAB_RIFLOCKR_RLOCK11_Msk    (0x1UL << RISAB_RIFLOCKR_RLOCK11_Pos)      /*!< 0x00000800 */
#define RISAB_RIFLOCKR_RLOCK11        RISAB_RIFLOCKR_RLOCK11_Msk
#define RISAB_RIFLOCKR_RLOCK12_Pos    (12U)
#define RISAB_RIFLOCKR_RLOCK12_Msk    (0x1UL << RISAB_RIFLOCKR_RLOCK12_Pos)      /*!< 0x00001000 */
#define RISAB_RIFLOCKR_RLOCK12        RISAB_RIFLOCKR_RLOCK12_Msk
#define RISAB_RIFLOCKR_RLOCK13_Pos    (13U)
#define RISAB_RIFLOCKR_RLOCK13_Msk    (0x1UL << RISAB_RIFLOCKR_RLOCK13_Pos)      /*!< 0x00002000 */
#define RISAB_RIFLOCKR_RLOCK13        RISAB_RIFLOCKR_RLOCK13_Msk
#define RISAB_RIFLOCKR_RLOCK14_Pos    (14U)
#define RISAB_RIFLOCKR_RLOCK14_Msk    (0x1UL << RISAB_RIFLOCKR_RLOCK14_Pos)      /*!< 0x00004000 */
#define RISAB_RIFLOCKR_RLOCK14        RISAB_RIFLOCKR_RLOCK14_Msk
#define RISAB_RIFLOCKR_RLOCK15_Pos    (15U)
#define RISAB_RIFLOCKR_RLOCK15_Msk    (0x1UL << RISAB_RIFLOCKR_RLOCK15_Pos)      /*!< 0x00008000 */
#define RISAB_RIFLOCKR_RLOCK15        RISAB_RIFLOCKR_RLOCK15_Msk
#define RISAB_RIFLOCKR_RLOCK16_Pos    (16U)
#define RISAB_RIFLOCKR_RLOCK16_Msk    (0x1UL << RISAB_RIFLOCKR_RLOCK16_Pos)      /*!< 0x00010000 */
#define RISAB_RIFLOCKR_RLOCK16        RISAB_RIFLOCKR_RLOCK16_Msk
#define RISAB_RIFLOCKR_RLOCK17_Pos    (17U)
#define RISAB_RIFLOCKR_RLOCK17_Msk    (0x1UL << RISAB_RIFLOCKR_RLOCK17_Pos)      /*!< 0x00020000 */
#define RISAB_RIFLOCKR_RLOCK17        RISAB_RIFLOCKR_RLOCK17_Msk
#define RISAB_RIFLOCKR_RLOCK18_Pos    (18U)
#define RISAB_RIFLOCKR_RLOCK18_Msk    (0x1UL << RISAB_RIFLOCKR_RLOCK18_Pos)      /*!< 0x00040000 */
#define RISAB_RIFLOCKR_RLOCK18        RISAB_RIFLOCKR_RLOCK18_Msk
#define RISAB_RIFLOCKR_RLOCK19_Pos    (19U)
#define RISAB_RIFLOCKR_RLOCK19_Msk    (0x1UL << RISAB_RIFLOCKR_RLOCK19_Pos)      /*!< 0x00080000 */
#define RISAB_RIFLOCKR_RLOCK19        RISAB_RIFLOCKR_RLOCK19_Msk
#define RISAB_RIFLOCKR_RLOCK20_Pos    (20U)
#define RISAB_RIFLOCKR_RLOCK20_Msk    (0x1UL << RISAB_RIFLOCKR_RLOCK20_Pos)      /*!< 0x00100000 */
#define RISAB_RIFLOCKR_RLOCK20        RISAB_RIFLOCKR_RLOCK20_Msk
#define RISAB_RIFLOCKR_RLOCK21_Pos    (21U)
#define RISAB_RIFLOCKR_RLOCK21_Msk    (0x1UL << RISAB_RIFLOCKR_RLOCK21_Pos)      /*!< 0x00200000 */
#define RISAB_RIFLOCKR_RLOCK21        RISAB_RIFLOCKR_RLOCK21_Msk
#define RISAB_RIFLOCKR_RLOCK22_Pos    (22U)
#define RISAB_RIFLOCKR_RLOCK22_Msk    (0x1UL << RISAB_RIFLOCKR_RLOCK22_Pos)      /*!< 0x00400000 */
#define RISAB_RIFLOCKR_RLOCK22        RISAB_RIFLOCKR_RLOCK22_Msk
#define RISAB_RIFLOCKR_RLOCK23_Pos    (23U)
#define RISAB_RIFLOCKR_RLOCK23_Msk    (0x1UL << RISAB_RIFLOCKR_RLOCK23_Pos)      /*!< 0x00800000 */
#define RISAB_RIFLOCKR_RLOCK23        RISAB_RIFLOCKR_RLOCK23_Msk
#define RISAB_RIFLOCKR_RLOCK24_Pos    (24U)
#define RISAB_RIFLOCKR_RLOCK24_Msk    (0x1UL << RISAB_RIFLOCKR_RLOCK24_Pos)      /*!< 0x01000000 */
#define RISAB_RIFLOCKR_RLOCK24        RISAB_RIFLOCKR_RLOCK24_Msk
#define RISAB_RIFLOCKR_RLOCK25_Pos    (25U)
#define RISAB_RIFLOCKR_RLOCK25_Msk    (0x1UL << RISAB_RIFLOCKR_RLOCK25_Pos)      /*!< 0x02000000 */
#define RISAB_RIFLOCKR_RLOCK25        RISAB_RIFLOCKR_RLOCK25_Msk
#define RISAB_RIFLOCKR_RLOCK26_Pos    (26U)
#define RISAB_RIFLOCKR_RLOCK26_Msk    (0x1UL << RISAB_RIFLOCKR_RLOCK26_Pos)      /*!< 0x04000000 */
#define RISAB_RIFLOCKR_RLOCK26        RISAB_RIFLOCKR_RLOCK26_Msk
#define RISAB_RIFLOCKR_RLOCK27_Pos    (27U)
#define RISAB_RIFLOCKR_RLOCK27_Msk    (0x1UL << RISAB_RIFLOCKR_RLOCK27_Pos)      /*!< 0x08000000 */
#define RISAB_RIFLOCKR_RLOCK27        RISAB_RIFLOCKR_RLOCK27_Msk
#define RISAB_RIFLOCKR_RLOCK28_Pos    (28U)
#define RISAB_RIFLOCKR_RLOCK28_Msk    (0x1UL << RISAB_RIFLOCKR_RLOCK28_Pos)      /*!< 0x10000000 */
#define RISAB_RIFLOCKR_RLOCK28        RISAB_RIFLOCKR_RLOCK28_Msk
#define RISAB_RIFLOCKR_RLOCK29_Pos    (29U)
#define RISAB_RIFLOCKR_RLOCK29_Msk    (0x1UL << RISAB_RIFLOCKR_RLOCK29_Pos)      /*!< 0x20000000 */
#define RISAB_RIFLOCKR_RLOCK29        RISAB_RIFLOCKR_RLOCK29_Msk
#define RISAB_RIFLOCKR_RLOCK30_Pos    (30U)
#define RISAB_RIFLOCKR_RLOCK30_Msk    (0x1UL << RISAB_RIFLOCKR_RLOCK30_Pos)      /*!< 0x40000000 */
#define RISAB_RIFLOCKR_RLOCK30        RISAB_RIFLOCKR_RLOCK30_Msk
#define RISAB_RIFLOCKR_RLOCK31_Pos    (31U)
#define RISAB_RIFLOCKR_RLOCK31_Msk    (0x1UL << RISAB_RIFLOCKR_RLOCK31_Pos)      /*!< 0x80000000 */
#define RISAB_RIFLOCKR_RLOCK31        RISAB_RIFLOCKR_RLOCK31_Msk

/*******************  Bits definition for RISAB_IAESR register ****************/
#define RISAB_IAESR_IACID_Pos         (0U)
#define RISAB_IAESR_IACID_Msk         (0x7UL << RISAB_IAESR_IACID_Pos)           /*!< 0x00000007 */
#define RISAB_IAESR_IACID             RISAB_IAESR_IACID_Msk
#define RISAB_IAESR_IACID0            (0x0UL << RISAB_IAESR_IACID_Pos)           /*!< 0x00000000 */
#define RISAB_IAESR_IACID1            (0x1UL << RISAB_IAESR_IACID_Pos)           /*!< 0x00000001 */
#define RISAB_IAESR_IACID2            (0x2UL << RISAB_IAESR_IACID_Pos)           /*!< 0x00000002 */
#define RISAB_IAESR_IACID3            (0x3UL << RISAB_IAESR_IACID_Pos)           /*!< 0x00000003 */
#define RISAB_IAESR_IACID4            (0x4UL << RISAB_IAESR_IACID_Pos)           /*!< 0x00000004 */
#define RISAB_IAESR_IACID5            (0x5UL << RISAB_IAESR_IACID_Pos)           /*!< 0x00000005 */
#define RISAB_IAESR_IACID6            (0x6UL << RISAB_IAESR_IACID_Pos)           /*!< 0x00000006 */
#define RISAB_IAESR_IACID7            (0x7UL << RISAB_IAESR_IACID_Pos)           /*!< 0x00000007 */

#define RISAB_IAESR_IAPRIV_Pos        (4U)
#define RISAB_IAESR_IAPRIV_Msk        (0x1UL << RISAB_IAESR_IAPRIV_Pos)          /*!< 0x00000010 */
#define RISAB_IAESR_IAPRIV            RISAB_IAESR_IAPRIV_Msk

